TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                              PC v20.2.6.LTS *
       3                    ;* Date/Time created: Mon Oct 31 23:16:54 2022                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("D:/Y2S1/SC2107 Lab/inc/Clock.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v20.2.6.LTS Copyright (c) 1996
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Y2S1\SC2107 Lab\Lab1_C_Programming\Debug")
      13                            .global ClockFrequency
      14 00000000                   .data
      15                            .align  4

     712 0000018e 000C695A  ||$C$CON6||:    .bits           0x4001000c,32
         00000192 00004001 
     713                    
     714                            .align  4
     715 00000192 00004001! ||$C$CON7||:    .bits   IFlags,32
         00000196 00000000 
     716                            .align  4
     717 00000196 00100000  ||$C$CON8||:    .bits           0x40010010,32
         0000019a 00004001 
     718                    
     719                            .align  4
     720 0000019a 00004001! ||$C$CON9||:    .bits   CPMwait,32
         0000019e 00000000 
     721                            .align  4
     722 0000019e A1200000  ||$C$CON10||:   .bits           0x7a120,32
         000001a2 00000007 
     723                    
     724                            .align  4
     725 000001a2 00000007! ||$C$CON11||:   .bits   Postwait,32
         000001a6 00000000 
     726                            .align  4
     727 000001a6 4D2A0000  ||$C$CON12||:   .bits           0x40004d2a,32
         000001aa 00004000 
     728                    
     729                            .align  4
     730 000001aa 4D2C4000  ||$C$CON13||:   .bits           0x40004d2c,32
         000001ae 00004000 
     731                    
     732                            .align  4
     733 000001ae 04004000  ||$C$CON14||:   .bits           0x40010400,32
         000001b2 00004001 
     734                    
     735                            .align  4
     736 000001b2 040C4001  ||$C$CON15||:   .bits           0x4001040c,32
         000001b6 00004001 
     737                    
     738                            .align  4
     739 000001b6 00004001  ||$C$CON16||:   .bits           0x1610000,32
         000001ba 00000161 
     740                    
     741                            .align  4
     742 000001ba 04500161  ||$C$CON17||:   .bits           0x40010450,32
         000001be 00004001 
     743                    
     744                            .align  4
     745 000001be 00004001! ||$C$CON18||:   .bits   Crystalstable,32
         000001c2 00000000 
     746                            .align  4
     747 000001c2 04480000  ||$C$CON19||:   .bits           0x40010448,32
         000001c6 00004001 
     748                    
     749                            .align  4
     750 000001c6 10104001  ||$C$CON20||:   .bits           0x40011010,32
         000001ca 00004001 
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   15

     751                    
     752                            .align  4
     753 000001ca 10144001  ||$C$CON21||:   .bits           0x40011014,32
         000001ce 00004001 
     754                    
     755                            .align  4
     756 000001ce 04084001  ||$C$CON22||:   .bits           0x40010408,32
         000001d2 00004001 
     757                    
     758                            .align  4
     759 000001d2 02554001  ||$C$CON23||:   .bits           0x20100255,32
         000001d6 00002010 
     760                    
     761                            .align  4
     762 000001d6 00002010! ||$C$CON24||:   .bits   ClockFrequency,32
         000001da 00000000 
     763                            .align  4
     764 000001da 6C000000  ||$C$CON25||:   .bits           0x2dc6c00,32
         000001de 000002DC 
     765                    
     766                    
     767                    ;******************************************************************************
     768                    ;* BUILD ATTRIBUTES                                                           *
     769                    ;******************************************************************************
     770                            .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     771                            .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0111111111100000000000000
     772                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     773                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     774                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     775                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     776                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     777                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     778                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
     779                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     780                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     781                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     782                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     783                    
     784                    ;******************************************************************************
     785                    ;* TYPE INFORMATION                                                           *
     786                    ;******************************************************************************
     787                    
     788                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
     789                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x14)
     790                    $C$DW$24        .dwtag  DW_TAG_member
     791                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$23)
     792                            .dwattr $C$DW$24, DW_AT_name("CTL0")
     793                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("CTL0")
     794                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     795                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     796                            .dwattr $C$DW$24, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     797                            .dwattr $C$DW$24, DW_AT_decl_line(0x3e2)
     798                            .dwattr $C$DW$24, DW_AT_decl_column(0x11)
     799                    
     800                    $C$DW$25        .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   16

     801                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$23)
     802                            .dwattr $C$DW$25, DW_AT_name("CTL1")
     803                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("CTL1")
     804                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     805                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     806                            .dwattr $C$DW$25, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     807                            .dwattr $C$DW$25, DW_AT_decl_line(0x3e3)
     808                            .dwattr $C$DW$25, DW_AT_decl_column(0x11)
     809                    
     810                    $C$DW$26        .dwtag  DW_TAG_member
     811                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$23)
     812                            .dwattr $C$DW$26, DW_AT_name("IE")
     813                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("IE")
     814                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     815                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     816                            .dwattr $C$DW$26, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     817                            .dwattr $C$DW$26, DW_AT_decl_line(0x3e4)
     818                            .dwattr $C$DW$26, DW_AT_decl_column(0x11)
     819                    
     820                    $C$DW$27        .dwtag  DW_TAG_member
     821                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$24)
     822                            .dwattr $C$DW$27, DW_AT_name("IFG")
     823                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("IFG")
     824                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     825                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     826                            .dwattr $C$DW$27, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     827                            .dwattr $C$DW$27, DW_AT_decl_line(0x3e5)
     828                            .dwattr $C$DW$27, DW_AT_decl_column(0x11)
     829                    
     830                    $C$DW$28        .dwtag  DW_TAG_member
     831                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$23)
     832                            .dwattr $C$DW$28, DW_AT_name("CLRIFG")
     833                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("CLRIFG")
     834                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     835                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     836                            .dwattr $C$DW$28, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     837                            .dwattr $C$DW$28, DW_AT_decl_line(0x3e6)
     838                            .dwattr $C$DW$28, DW_AT_decl_column(0x11)
     839                    
     840                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     841                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x3e1)
     842                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     843                            .dwendtag $C$DW$T$25
     844                    
     845                    $C$DW$T$179     .dwtag  DW_TAG_typedef
     846                            .dwattr $C$DW$T$179, DW_AT_name("PCM_Type")
     847                            .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$25)
     848                            .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
     849                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     850                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x3e7)
     851                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x03)
     852                    
     853                    
     854                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
     855                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   17

     856                    $C$DW$29        .dwtag  DW_TAG_member
     857                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$28)
     858                            .dwattr $C$DW$29, DW_AT_name("SEL0_L")
     859                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("SEL0_L")
     860                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     861                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     862                            .dwattr $C$DW$29, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     863                            .dwattr $C$DW$29, DW_AT_decl_line(0x271)
     864                            .dwattr $C$DW$29, DW_AT_decl_column(0x14)
     865                    
     866                    $C$DW$30        .dwtag  DW_TAG_member
     867                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$28)
     868                            .dwattr $C$DW$30, DW_AT_name("SEL0_H")
     869                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("SEL0_H")
     870                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     871                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     872                            .dwattr $C$DW$30, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     873                            .dwattr $C$DW$30, DW_AT_decl_line(0x272)
     874                            .dwattr $C$DW$30, DW_AT_decl_column(0x14)
     875                    
     876                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     877                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x270)
     878                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0c)
     879                            .dwendtag $C$DW$T$29
     880                    
     881                    
     882                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
     883                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     884                    $C$DW$31        .dwtag  DW_TAG_member
     885                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$30)
     886                            .dwattr $C$DW$31, DW_AT_name("IN_L")
     887                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("IN_L")
     888                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     889                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     890                            .dwattr $C$DW$31, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     891                            .dwattr $C$DW$31, DW_AT_decl_line(0x24e)
     892                            .dwattr $C$DW$31, DW_AT_decl_column(0x13)
     893                    
     894                    $C$DW$32        .dwtag  DW_TAG_member
     895                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$30)
     896                            .dwattr $C$DW$32, DW_AT_name("IN_H")
     897                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("IN_H")
     898                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     899                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     900                            .dwattr $C$DW$32, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     901                            .dwattr $C$DW$32, DW_AT_decl_line(0x24f)
     902                            .dwattr $C$DW$32, DW_AT_decl_column(0x13)
     903                    
     904                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     905                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x24d)
     906                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x0c)
     907                            .dwendtag $C$DW$T$31
     908                    
     909                    
     910                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   18

     911                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
     912                    $C$DW$33        .dwtag  DW_TAG_member
     913                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$28)
     914                            .dwattr $C$DW$33, DW_AT_name("OUT_L")
     915                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("OUT_L")
     916                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     917                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     918                            .dwattr $C$DW$33, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     919                            .dwattr $C$DW$33, DW_AT_decl_line(0x255)
     920                            .dwattr $C$DW$33, DW_AT_decl_column(0x14)
     921                    
     922                    $C$DW$34        .dwtag  DW_TAG_member
     923                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$28)
     924                            .dwattr $C$DW$34, DW_AT_name("OUT_H")
     925                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("OUT_H")
     926                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     927                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     928                            .dwattr $C$DW$34, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     929                            .dwattr $C$DW$34, DW_AT_decl_line(0x256)
     930                            .dwattr $C$DW$34, DW_AT_decl_column(0x14)
     931                    
     932                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     933                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x254)
     934                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0c)
     935                            .dwendtag $C$DW$T$32
     936                    
     937                    
     938                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
     939                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
     940                    $C$DW$35        .dwtag  DW_TAG_member
     941                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$28)
     942                            .dwattr $C$DW$35, DW_AT_name("DIR_L")
     943                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("DIR_L")
     944                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     945                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     946                            .dwattr $C$DW$35, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     947                            .dwattr $C$DW$35, DW_AT_decl_line(0x25c)
     948                            .dwattr $C$DW$35, DW_AT_decl_column(0x14)
     949                    
     950                    $C$DW$36        .dwtag  DW_TAG_member
     951                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$28)
     952                            .dwattr $C$DW$36, DW_AT_name("DIR_H")
     953                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("DIR_H")
     954                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     955                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     956                            .dwattr $C$DW$36, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     957                            .dwattr $C$DW$36, DW_AT_decl_line(0x25d)
     958                            .dwattr $C$DW$36, DW_AT_decl_column(0x14)
     959                    
     960                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     961                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x25b)
     962                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0c)
     963                            .dwendtag $C$DW$T$33
     964                    
     965                    
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   19

     966                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
     967                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
     968                    $C$DW$37        .dwtag  DW_TAG_member
     969                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$28)
     970                            .dwattr $C$DW$37, DW_AT_name("REN_L")
     971                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("REN_L")
     972                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     973                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     974                            .dwattr $C$DW$37, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     975                            .dwattr $C$DW$37, DW_AT_decl_line(0x263)
     976                            .dwattr $C$DW$37, DW_AT_decl_column(0x14)
     977                    
     978                    $C$DW$38        .dwtag  DW_TAG_member
     979                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$28)
     980                            .dwattr $C$DW$38, DW_AT_name("REN_H")
     981                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("REN_H")
     982                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     983                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     984                            .dwattr $C$DW$38, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     985                            .dwattr $C$DW$38, DW_AT_decl_line(0x264)
     986                            .dwattr $C$DW$38, DW_AT_decl_column(0x14)
     987                    
     988                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     989                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x262)
     990                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0c)
     991                            .dwendtag $C$DW$T$34
     992                    
     993                    
     994                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
     995                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
     996                    $C$DW$39        .dwtag  DW_TAG_member
     997                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$28)
     998                            .dwattr $C$DW$39, DW_AT_name("DS_L")
     999                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("DS_L")
    1000                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
    1002                            .dwattr $C$DW$39, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1003                            .dwattr $C$DW$39, DW_AT_decl_line(0x26a)
    1004                            .dwattr $C$DW$39, DW_AT_decl_column(0x14)
    1005                    
    1006                    $C$DW$40        .dwtag  DW_TAG_member
    1007                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$28)
    1008                            .dwattr $C$DW$40, DW_AT_name("DS_H")
    1009                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("DS_H")
    1010                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1011                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
    1012                            .dwattr $C$DW$40, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1013                            .dwattr $C$DW$40, DW_AT_decl_line(0x26b)
    1014                            .dwattr $C$DW$40, DW_AT_decl_column(0x14)
    1015                    
    1016                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1017                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x269)
    1018                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0c)
    1019                            .dwendtag $C$DW$T$35
    1020                    
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   20

    1021                    
    1022                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1023                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1024                    $C$DW$41        .dwtag  DW_TAG_member
    1025                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$28)
    1026                            .dwattr $C$DW$41, DW_AT_name("SEL1_L")
    1027                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("SEL1_L")
    1028                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1029                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1030                            .dwattr $C$DW$41, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1031                            .dwattr $C$DW$41, DW_AT_decl_line(0x278)
    1032                            .dwattr $C$DW$41, DW_AT_decl_column(0x14)
    1033                    
    1034                    $C$DW$42        .dwtag  DW_TAG_member
    1035                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$28)
    1036                            .dwattr $C$DW$42, DW_AT_name("SEL1_H")
    1037                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("SEL1_H")
    1038                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1039                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1040                            .dwattr $C$DW$42, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1041                            .dwattr $C$DW$42, DW_AT_decl_line(0x279)
    1042                            .dwattr $C$DW$42, DW_AT_decl_column(0x14)
    1043                    
    1044                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1045                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x277)
    1046                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0c)
    1047                            .dwendtag $C$DW$T$36
    1048                    
    1049                    
    1050                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1051                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1052                    $C$DW$43        .dwtag  DW_TAG_member
    1053                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$28)
    1054                            .dwattr $C$DW$43, DW_AT_name("SELC_L")
    1055                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("SELC_L")
    1056                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1057                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1058                            .dwattr $C$DW$43, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1059                            .dwattr $C$DW$43, DW_AT_decl_line(0x280)
    1060                            .dwattr $C$DW$43, DW_AT_decl_column(0x14)
    1061                    
    1062                    $C$DW$44        .dwtag  DW_TAG_member
    1063                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$28)
    1064                            .dwattr $C$DW$44, DW_AT_name("SELC_H")
    1065                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("SELC_H")
    1066                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1067                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1068                            .dwattr $C$DW$44, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1069                            .dwattr $C$DW$44, DW_AT_decl_line(0x281)
    1070                            .dwattr $C$DW$44, DW_AT_decl_column(0x14)
    1071                    
    1072                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1073                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x27f)
    1074                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x0c)
    1075                            .dwendtag $C$DW$T$37
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   21

    1076                    
    1077                    
    1078                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1079                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x18)
    1080                    $C$DW$45        .dwtag  DW_TAG_member
    1081                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$152)
    1082                            .dwattr $C$DW$45, DW_AT_name("$P$T2")
    1083                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("$P$T2")
    1084                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1086                            .dwattr $C$DW$45, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1087                            .dwattr $C$DW$45, DW_AT_decl_line(0x24b)
    1088                            .dwattr $C$DW$45, DW_AT_decl_column(0x03)
    1089                    
    1090                    $C$DW$46        .dwtag  DW_TAG_member
    1091                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$153)
    1092                            .dwattr $C$DW$46, DW_AT_name("$P$T4")
    1093                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("$P$T4")
    1094                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1095                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1096                            .dwattr $C$DW$46, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1097                            .dwattr $C$DW$46, DW_AT_decl_line(0x252)
    1098                            .dwattr $C$DW$46, DW_AT_decl_column(0x03)
    1099                    
    1100                    $C$DW$47        .dwtag  DW_TAG_member
    1101                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$154)
    1102                            .dwattr $C$DW$47, DW_AT_name("$P$T6")
    1103                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("$P$T6")
    1104                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1105                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1106                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1107                            .dwattr $C$DW$47, DW_AT_decl_line(0x259)
    1108                            .dwattr $C$DW$47, DW_AT_decl_column(0x03)
    1109                    
    1110                    $C$DW$48        .dwtag  DW_TAG_member
    1111                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$155)
    1112                            .dwattr $C$DW$48, DW_AT_name("$P$T8")
    1113                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("$P$T8")
    1114                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1115                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1116                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1117                            .dwattr $C$DW$48, DW_AT_decl_line(0x260)
    1118                            .dwattr $C$DW$48, DW_AT_decl_column(0x03)
    1119                    
    1120                    $C$DW$49        .dwtag  DW_TAG_member
    1121                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$156)
    1122                            .dwattr $C$DW$49, DW_AT_name("$P$T10")
    1123                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("$P$T10")
    1124                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1125                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1126                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1127                            .dwattr $C$DW$49, DW_AT_decl_line(0x267)
    1128                            .dwattr $C$DW$49, DW_AT_decl_column(0x03)
    1129                    
    1130                    $C$DW$50        .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   22

    1131                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$151)
    1132                            .dwattr $C$DW$50, DW_AT_name("$P$T11")
    1133                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("$P$T11")
    1134                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1135                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1136                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1137                            .dwattr $C$DW$50, DW_AT_decl_line(0x26e)
    1138                            .dwattr $C$DW$50, DW_AT_decl_column(0x03)
    1139                    
    1140                    $C$DW$51        .dwtag  DW_TAG_member
    1141                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$157)
    1142                            .dwattr $C$DW$51, DW_AT_name("$P$T13")
    1143                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("$P$T13")
    1144                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1145                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1146                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1147                            .dwattr $C$DW$51, DW_AT_decl_line(0x275)
    1148                            .dwattr $C$DW$51, DW_AT_decl_column(0x03)
    1149                    
    1150                    $C$DW$52        .dwtag  DW_TAG_member
    1151                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$40)
    1152                            .dwattr $C$DW$52, DW_AT_name("RESERVED0")
    1153                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("RESERVED0")
    1154                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1155                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1156                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1157                            .dwattr $C$DW$52, DW_AT_decl_line(0x27c)
    1158                            .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
    1159                    
    1160                    $C$DW$53        .dwtag  DW_TAG_member
    1161                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$158)
    1162                            .dwattr $C$DW$53, DW_AT_name("$P$T15")
    1163                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("$P$T15")
    1164                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1165                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1166                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1167                            .dwattr $C$DW$53, DW_AT_decl_line(0x27d)
    1168                            .dwattr $C$DW$53, DW_AT_decl_column(0x03)
    1169                    
    1170                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1171                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x24a)
    1172                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    1173                            .dwendtag $C$DW$T$41
    1174                    
    1175                    $C$DW$T$181     .dwtag  DW_TAG_typedef
    1176                            .dwattr $C$DW$T$181, DW_AT_name("DIO_PORT_Not_Interruptable_Type")
    1177                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$41)
    1178                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    1179                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1180                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x284)
    1181                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x03)
    1182                    
    1183                    
    1184                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1185                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x68)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   23

    1186                    $C$DW$54        .dwtag  DW_TAG_member
    1187                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$23)
    1188                            .dwattr $C$DW$54, DW_AT_name("KEY")
    1189                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("KEY")
    1190                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1191                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1192                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1193                            .dwattr $C$DW$54, DW_AT_decl_line(0x1d9)
    1194                            .dwattr $C$DW$54, DW_AT_decl_column(0x11)
    1195                    
    1196                    $C$DW$55        .dwtag  DW_TAG_member
    1197                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$23)
    1198                            .dwattr $C$DW$55, DW_AT_name("CTL0")
    1199                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("CTL0")
    1200                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1201                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1202                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1203                            .dwattr $C$DW$55, DW_AT_decl_line(0x1da)
    1204                            .dwattr $C$DW$55, DW_AT_decl_column(0x11)
    1205                    
    1206                    $C$DW$56        .dwtag  DW_TAG_member
    1207                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$23)
    1208                            .dwattr $C$DW$56, DW_AT_name("CTL1")
    1209                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("CTL1")
    1210                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1211                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1212                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1213                            .dwattr $C$DW$56, DW_AT_decl_line(0x1db)
    1214                            .dwattr $C$DW$56, DW_AT_decl_column(0x11)
    1215                    
    1216                    $C$DW$57        .dwtag  DW_TAG_member
    1217                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$23)
    1218                            .dwattr $C$DW$57, DW_AT_name("CTL2")
    1219                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("CTL2")
    1220                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1221                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1222                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1223                            .dwattr $C$DW$57, DW_AT_decl_line(0x1dc)
    1224                            .dwattr $C$DW$57, DW_AT_decl_column(0x11)
    1225                    
    1226                    $C$DW$58        .dwtag  DW_TAG_member
    1227                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$23)
    1228                            .dwattr $C$DW$58, DW_AT_name("CTL3")
    1229                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("CTL3")
    1230                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1231                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1232                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1233                            .dwattr $C$DW$58, DW_AT_decl_line(0x1dd)
    1234                            .dwattr $C$DW$58, DW_AT_decl_column(0x11)
    1235                    
    1236                    $C$DW$59        .dwtag  DW_TAG_member
    1237                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$42)
    1238                            .dwattr $C$DW$59, DW_AT_name("RESERVED0")
    1239                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("RESERVED0")
    1240                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   24

    1241                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1242                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1243                            .dwattr $C$DW$59, DW_AT_decl_line(0x1de)
    1244                            .dwattr $C$DW$59, DW_AT_decl_column(0x11)
    1245                    
    1246                    $C$DW$60        .dwtag  DW_TAG_member
    1247                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$23)
    1248                            .dwattr $C$DW$60, DW_AT_name("CLKEN")
    1249                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("CLKEN")
    1250                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1251                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1252                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1253                            .dwattr $C$DW$60, DW_AT_decl_line(0x1df)
    1254                            .dwattr $C$DW$60, DW_AT_decl_column(0x11)
    1255                    
    1256                    $C$DW$61        .dwtag  DW_TAG_member
    1257                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$24)
    1258                            .dwattr $C$DW$61, DW_AT_name("STAT")
    1259                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("STAT")
    1260                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1261                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1262                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1263                            .dwattr $C$DW$61, DW_AT_decl_line(0x1e0)
    1264                            .dwattr $C$DW$61, DW_AT_decl_column(0x11)
    1265                    
    1266                    $C$DW$62        .dwtag  DW_TAG_member
    1267                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$43)
    1268                            .dwattr $C$DW$62, DW_AT_name("RESERVED1")
    1269                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("RESERVED1")
    1270                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1271                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1272                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1273                            .dwattr $C$DW$62, DW_AT_decl_line(0x1e1)
    1274                            .dwattr $C$DW$62, DW_AT_decl_column(0x11)
    1275                    
    1276                    $C$DW$63        .dwtag  DW_TAG_member
    1277                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$23)
    1278                            .dwattr $C$DW$63, DW_AT_name("IE")
    1279                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("IE")
    1280                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1281                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1282                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1283                            .dwattr $C$DW$63, DW_AT_decl_line(0x1e2)
    1284                            .dwattr $C$DW$63, DW_AT_decl_column(0x11)
    1285                    
    1286                    $C$DW$64        .dwtag  DW_TAG_member
    1287                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$22)
    1288                            .dwattr $C$DW$64, DW_AT_name("RESERVED2")
    1289                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("RESERVED2")
    1290                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1291                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1292                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1293                            .dwattr $C$DW$64, DW_AT_decl_line(0x1e3)
    1294                            .dwattr $C$DW$64, DW_AT_decl_column(0x11)
    1295                    
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   25

    1296                    $C$DW$65        .dwtag  DW_TAG_member
    1297                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$24)
    1298                            .dwattr $C$DW$65, DW_AT_name("IFG")
    1299                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("IFG")
    1300                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1301                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1302                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1303                            .dwattr $C$DW$65, DW_AT_decl_line(0x1e4)
    1304                            .dwattr $C$DW$65, DW_AT_decl_column(0x11)
    1305                    
    1306                    $C$DW$66        .dwtag  DW_TAG_member
    1307                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$22)
    1308                            .dwattr $C$DW$66, DW_AT_name("RESERVED3")
    1309                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("RESERVED3")
    1310                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1311                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1312                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1313                            .dwattr $C$DW$66, DW_AT_decl_line(0x1e5)
    1314                            .dwattr $C$DW$66, DW_AT_decl_column(0x11)
    1315                    
    1316                    $C$DW$67        .dwtag  DW_TAG_member
    1317                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$23)
    1318                            .dwattr $C$DW$67, DW_AT_name("CLRIFG")
    1319                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("CLRIFG")
    1320                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1321                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1322                            .dwattr $C$DW$67, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1323                            .dwattr $C$DW$67, DW_AT_decl_line(0x1e6)
    1324                            .dwattr $C$DW$67, DW_AT_decl_column(0x11)
    1325                    
    1326                    $C$DW$68        .dwtag  DW_TAG_member
    1327                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$22)
    1328                            .dwattr $C$DW$68, DW_AT_name("RESERVED4")
    1329                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("RESERVED4")
    1330                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1331                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1332                            .dwattr $C$DW$68, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1333                            .dwattr $C$DW$68, DW_AT_decl_line(0x1e7)
    1334                            .dwattr $C$DW$68, DW_AT_decl_column(0x11)
    1335                    
    1336                    $C$DW$69        .dwtag  DW_TAG_member
    1337                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$23)
    1338                            .dwattr $C$DW$69, DW_AT_name("SETIFG")
    1339                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("SETIFG")
    1340                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1341                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1342                            .dwattr $C$DW$69, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1343                            .dwattr $C$DW$69, DW_AT_decl_line(0x1e8)
    1344                            .dwattr $C$DW$69, DW_AT_decl_column(0x11)
    1345                    
    1346                    $C$DW$70        .dwtag  DW_TAG_member
    1347                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$22)
    1348                            .dwattr $C$DW$70, DW_AT_name("RESERVED5")
    1349                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("RESERVED5")
    1350                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   26

    1351                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1352                            .dwattr $C$DW$70, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1353                            .dwattr $C$DW$70, DW_AT_decl_line(0x1e9)
    1354                            .dwattr $C$DW$70, DW_AT_decl_column(0x11)
    1355                    
    1356                    $C$DW$71        .dwtag  DW_TAG_member
    1357                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$23)
    1358                            .dwattr $C$DW$71, DW_AT_name("DCOERCAL0")
    1359                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("DCOERCAL0")
    1360                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1361                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1362                            .dwattr $C$DW$71, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1363                            .dwattr $C$DW$71, DW_AT_decl_line(0x1ea)
    1364                            .dwattr $C$DW$71, DW_AT_decl_column(0x11)
    1365                    
    1366                    $C$DW$72        .dwtag  DW_TAG_member
    1367                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$23)
    1368                            .dwattr $C$DW$72, DW_AT_name("DCOERCAL1")
    1369                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("DCOERCAL1")
    1370                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1371                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1372                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1373                            .dwattr $C$DW$72, DW_AT_decl_line(0x1eb)
    1374                            .dwattr $C$DW$72, DW_AT_decl_column(0x11)
    1375                    
    1376                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1377                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x1d8)
    1378                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    1379                            .dwendtag $C$DW$T$44
    1380                    
    1381                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    1382                            .dwattr $C$DW$T$183, DW_AT_name("CS_Type")
    1383                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$44)
    1384                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    1385                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1386                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x1ec)
    1387                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x03)
    1388                    
    1389                    
    1390                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1391                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x124)
    1392                    $C$DW$73        .dwtag  DW_TAG_member
    1393                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$24)
    1394                            .dwattr $C$DW$73, DW_AT_name("POWER_STAT")
    1395                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("POWER_STAT")
    1396                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1397                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1398                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1399                            .dwattr $C$DW$73, DW_AT_decl_line(0x352)
    1400                            .dwattr $C$DW$73, DW_AT_decl_column(0x11)
    1401                    
    1402                    $C$DW$74        .dwtag  DW_TAG_member
    1403                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$45)
    1404                            .dwattr $C$DW$74, DW_AT_name("RESERVED0")
    1405                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("RESERVED0")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   27

    1406                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1407                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1408                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1409                            .dwattr $C$DW$74, DW_AT_decl_line(0x353)
    1410                            .dwattr $C$DW$74, DW_AT_decl_column(0x11)
    1411                    
    1412                    $C$DW$75        .dwtag  DW_TAG_member
    1413                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$23)
    1414                            .dwattr $C$DW$75, DW_AT_name("BANK0_RDCTL")
    1415                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("BANK0_RDCTL")
    1416                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1417                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1418                            .dwattr $C$DW$75, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1419                            .dwattr $C$DW$75, DW_AT_decl_line(0x354)
    1420                            .dwattr $C$DW$75, DW_AT_decl_column(0x11)
    1421                    
    1422                    $C$DW$76        .dwtag  DW_TAG_member
    1423                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$23)
    1424                            .dwattr $C$DW$76, DW_AT_name("BANK1_RDCTL")
    1425                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("BANK1_RDCTL")
    1426                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1427                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1428                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1429                            .dwattr $C$DW$76, DW_AT_decl_line(0x355)
    1430                            .dwattr $C$DW$76, DW_AT_decl_column(0x11)
    1431                    
    1432                    $C$DW$77        .dwtag  DW_TAG_member
    1433                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$43)
    1434                            .dwattr $C$DW$77, DW_AT_name("RESERVED1")
    1435                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("RESERVED1")
    1436                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1437                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1438                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1439                            .dwattr $C$DW$77, DW_AT_decl_line(0x356)
    1440                            .dwattr $C$DW$77, DW_AT_decl_column(0x11)
    1441                    
    1442                    $C$DW$78        .dwtag  DW_TAG_member
    1443                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$23)
    1444                            .dwattr $C$DW$78, DW_AT_name("RDBRST_CTLSTAT")
    1445                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("RDBRST_CTLSTAT")
    1446                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1447                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1448                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1449                            .dwattr $C$DW$78, DW_AT_decl_line(0x357)
    1450                            .dwattr $C$DW$78, DW_AT_decl_column(0x11)
    1451                    
    1452                    $C$DW$79        .dwtag  DW_TAG_member
    1453                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$23)
    1454                            .dwattr $C$DW$79, DW_AT_name("RDBRST_STARTADDR")
    1455                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("RDBRST_STARTADDR")
    1456                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1457                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1458                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1459                            .dwattr $C$DW$79, DW_AT_decl_line(0x358)
    1460                            .dwattr $C$DW$79, DW_AT_decl_column(0x11)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   28

    1461                    
    1462                    $C$DW$80        .dwtag  DW_TAG_member
    1463                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$23)
    1464                            .dwattr $C$DW$80, DW_AT_name("RDBRST_LEN")
    1465                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("RDBRST_LEN")
    1466                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1467                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1468                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1469                            .dwattr $C$DW$80, DW_AT_decl_line(0x359)
    1470                            .dwattr $C$DW$80, DW_AT_decl_column(0x11)
    1471                    
    1472                    $C$DW$81        .dwtag  DW_TAG_member
    1473                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$46)
    1474                            .dwattr $C$DW$81, DW_AT_name("RESERVED2")
    1475                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("RESERVED2")
    1476                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1477                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1478                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1479                            .dwattr $C$DW$81, DW_AT_decl_line(0x35a)
    1480                            .dwattr $C$DW$81, DW_AT_decl_column(0x11)
    1481                    
    1482                    $C$DW$82        .dwtag  DW_TAG_member
    1483                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$23)
    1484                            .dwattr $C$DW$82, DW_AT_name("RDBRST_FAILADDR")
    1485                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("RDBRST_FAILADDR")
    1486                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1487                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1488                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1489                            .dwattr $C$DW$82, DW_AT_decl_line(0x35b)
    1490                            .dwattr $C$DW$82, DW_AT_decl_column(0x11)
    1491                    
    1492                    $C$DW$83        .dwtag  DW_TAG_member
    1493                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$23)
    1494                            .dwattr $C$DW$83, DW_AT_name("RDBRST_FAILCNT")
    1495                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("RDBRST_FAILCNT")
    1496                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1497                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1498                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1499                            .dwattr $C$DW$83, DW_AT_decl_line(0x35c)
    1500                            .dwattr $C$DW$83, DW_AT_decl_column(0x11)
    1501                    
    1502                    $C$DW$84        .dwtag  DW_TAG_member
    1503                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$45)
    1504                            .dwattr $C$DW$84, DW_AT_name("RESERVED3")
    1505                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("RESERVED3")
    1506                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1507                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1508                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1509                            .dwattr $C$DW$84, DW_AT_decl_line(0x35d)
    1510                            .dwattr $C$DW$84, DW_AT_decl_column(0x11)
    1511                    
    1512                    $C$DW$85        .dwtag  DW_TAG_member
    1513                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$23)
    1514                            .dwattr $C$DW$85, DW_AT_name("PRG_CTLSTAT")
    1515                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRG_CTLSTAT")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   29

    1516                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1517                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1518                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1519                            .dwattr $C$DW$85, DW_AT_decl_line(0x35e)
    1520                            .dwattr $C$DW$85, DW_AT_decl_column(0x11)
    1521                    
    1522                    $C$DW$86        .dwtag  DW_TAG_member
    1523                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$23)
    1524                            .dwattr $C$DW$86, DW_AT_name("PRGBRST_CTLSTAT")
    1525                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRGBRST_CTLSTAT")
    1526                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1527                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1528                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1529                            .dwattr $C$DW$86, DW_AT_decl_line(0x35f)
    1530                            .dwattr $C$DW$86, DW_AT_decl_column(0x11)
    1531                    
    1532                    $C$DW$87        .dwtag  DW_TAG_member
    1533                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$23)
    1534                            .dwattr $C$DW$87, DW_AT_name("PRGBRST_STARTADDR")
    1535                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRGBRST_STARTADDR")
    1536                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1537                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1538                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1539                            .dwattr $C$DW$87, DW_AT_decl_line(0x360)
    1540                            .dwattr $C$DW$87, DW_AT_decl_column(0x11)
    1541                    
    1542                    $C$DW$88        .dwtag  DW_TAG_member
    1543                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$22)
    1544                            .dwattr $C$DW$88, DW_AT_name("RESERVED4")
    1545                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("RESERVED4")
    1546                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1547                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1548                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1549                            .dwattr $C$DW$88, DW_AT_decl_line(0x361)
    1550                            .dwattr $C$DW$88, DW_AT_decl_column(0x11)
    1551                    
    1552                    $C$DW$89        .dwtag  DW_TAG_member
    1553                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$23)
    1554                            .dwattr $C$DW$89, DW_AT_name("PRGBRST_DATA0_0")
    1555                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRGBRST_DATA0_0")
    1556                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1557                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1558                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1559                            .dwattr $C$DW$89, DW_AT_decl_line(0x362)
    1560                            .dwattr $C$DW$89, DW_AT_decl_column(0x11)
    1561                    
    1562                    $C$DW$90        .dwtag  DW_TAG_member
    1563                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$23)
    1564                            .dwattr $C$DW$90, DW_AT_name("PRGBRST_DATA0_1")
    1565                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRGBRST_DATA0_1")
    1566                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1567                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1568                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1569                            .dwattr $C$DW$90, DW_AT_decl_line(0x363)
    1570                            .dwattr $C$DW$90, DW_AT_decl_column(0x11)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   30

    1571                    
    1572                    $C$DW$91        .dwtag  DW_TAG_member
    1573                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$23)
    1574                            .dwattr $C$DW$91, DW_AT_name("PRGBRST_DATA0_2")
    1575                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("PRGBRST_DATA0_2")
    1576                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1577                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1578                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1579                            .dwattr $C$DW$91, DW_AT_decl_line(0x364)
    1580                            .dwattr $C$DW$91, DW_AT_decl_column(0x11)
    1581                    
    1582                    $C$DW$92        .dwtag  DW_TAG_member
    1583                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$23)
    1584                            .dwattr $C$DW$92, DW_AT_name("PRGBRST_DATA0_3")
    1585                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("PRGBRST_DATA0_3")
    1586                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1587                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1588                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1589                            .dwattr $C$DW$92, DW_AT_decl_line(0x365)
    1590                            .dwattr $C$DW$92, DW_AT_decl_column(0x11)
    1591                    
    1592                    $C$DW$93        .dwtag  DW_TAG_member
    1593                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$23)
    1594                            .dwattr $C$DW$93, DW_AT_name("PRGBRST_DATA1_0")
    1595                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRGBRST_DATA1_0")
    1596                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    1597                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1598                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1599                            .dwattr $C$DW$93, DW_AT_decl_line(0x366)
    1600                            .dwattr $C$DW$93, DW_AT_decl_column(0x11)
    1601                    
    1602                    $C$DW$94        .dwtag  DW_TAG_member
    1603                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$23)
    1604                            .dwattr $C$DW$94, DW_AT_name("PRGBRST_DATA1_1")
    1605                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("PRGBRST_DATA1_1")
    1606                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1607                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1608                            .dwattr $C$DW$94, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1609                            .dwattr $C$DW$94, DW_AT_decl_line(0x367)
    1610                            .dwattr $C$DW$94, DW_AT_decl_column(0x11)
    1611                    
    1612                    $C$DW$95        .dwtag  DW_TAG_member
    1613                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$23)
    1614                            .dwattr $C$DW$95, DW_AT_name("PRGBRST_DATA1_2")
    1615                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("PRGBRST_DATA1_2")
    1616                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1617                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1618                            .dwattr $C$DW$95, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1619                            .dwattr $C$DW$95, DW_AT_decl_line(0x368)
    1620                            .dwattr $C$DW$95, DW_AT_decl_column(0x11)
    1621                    
    1622                    $C$DW$96        .dwtag  DW_TAG_member
    1623                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$23)
    1624                            .dwattr $C$DW$96, DW_AT_name("PRGBRST_DATA1_3")
    1625                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("PRGBRST_DATA1_3")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   31

    1626                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1627                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1628                            .dwattr $C$DW$96, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1629                            .dwattr $C$DW$96, DW_AT_decl_line(0x369)
    1630                            .dwattr $C$DW$96, DW_AT_decl_column(0x11)
    1631                    
    1632                    $C$DW$97        .dwtag  DW_TAG_member
    1633                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$23)
    1634                            .dwattr $C$DW$97, DW_AT_name("PRGBRST_DATA2_0")
    1635                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("PRGBRST_DATA2_0")
    1636                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1637                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1638                            .dwattr $C$DW$97, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1639                            .dwattr $C$DW$97, DW_AT_decl_line(0x36a)
    1640                            .dwattr $C$DW$97, DW_AT_decl_column(0x11)
    1641                    
    1642                    $C$DW$98        .dwtag  DW_TAG_member
    1643                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$23)
    1644                            .dwattr $C$DW$98, DW_AT_name("PRGBRST_DATA2_1")
    1645                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("PRGBRST_DATA2_1")
    1646                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    1647                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1648                            .dwattr $C$DW$98, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1649                            .dwattr $C$DW$98, DW_AT_decl_line(0x36b)
    1650                            .dwattr $C$DW$98, DW_AT_decl_column(0x11)
    1651                    
    1652                    $C$DW$99        .dwtag  DW_TAG_member
    1653                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$23)
    1654                            .dwattr $C$DW$99, DW_AT_name("PRGBRST_DATA2_2")
    1655                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("PRGBRST_DATA2_2")
    1656                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1657                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1658                            .dwattr $C$DW$99, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1659                            .dwattr $C$DW$99, DW_AT_decl_line(0x36c)
    1660                            .dwattr $C$DW$99, DW_AT_decl_column(0x11)
    1661                    
    1662                    $C$DW$100       .dwtag  DW_TAG_member
    1663                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$23)
    1664                            .dwattr $C$DW$100, DW_AT_name("PRGBRST_DATA2_3")
    1665                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("PRGBRST_DATA2_3")
    1666                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    1667                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1668                            .dwattr $C$DW$100, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1669                            .dwattr $C$DW$100, DW_AT_decl_line(0x36d)
    1670                            .dwattr $C$DW$100, DW_AT_decl_column(0x11)
    1671                    
    1672                    $C$DW$101       .dwtag  DW_TAG_member
    1673                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$23)
    1674                            .dwattr $C$DW$101, DW_AT_name("PRGBRST_DATA3_0")
    1675                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("PRGBRST_DATA3_0")
    1676                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    1677                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1678                            .dwattr $C$DW$101, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1679                            .dwattr $C$DW$101, DW_AT_decl_line(0x36e)
    1680                            .dwattr $C$DW$101, DW_AT_decl_column(0x11)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   32

    1681                    
    1682                    $C$DW$102       .dwtag  DW_TAG_member
    1683                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$23)
    1684                            .dwattr $C$DW$102, DW_AT_name("PRGBRST_DATA3_1")
    1685                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("PRGBRST_DATA3_1")
    1686                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    1687                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1688                            .dwattr $C$DW$102, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1689                            .dwattr $C$DW$102, DW_AT_decl_line(0x36f)
    1690                            .dwattr $C$DW$102, DW_AT_decl_column(0x11)
    1691                    
    1692                    $C$DW$103       .dwtag  DW_TAG_member
    1693                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$23)
    1694                            .dwattr $C$DW$103, DW_AT_name("PRGBRST_DATA3_2")
    1695                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRGBRST_DATA3_2")
    1696                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    1697                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1698                            .dwattr $C$DW$103, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1699                            .dwattr $C$DW$103, DW_AT_decl_line(0x370)
    1700                            .dwattr $C$DW$103, DW_AT_decl_column(0x11)
    1701                    
    1702                    $C$DW$104       .dwtag  DW_TAG_member
    1703                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$23)
    1704                            .dwattr $C$DW$104, DW_AT_name("PRGBRST_DATA3_3")
    1705                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("PRGBRST_DATA3_3")
    1706                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    1707                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1708                            .dwattr $C$DW$104, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1709                            .dwattr $C$DW$104, DW_AT_decl_line(0x371)
    1710                            .dwattr $C$DW$104, DW_AT_decl_column(0x11)
    1711                    
    1712                    $C$DW$105       .dwtag  DW_TAG_member
    1713                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$23)
    1714                            .dwattr $C$DW$105, DW_AT_name("ERASE_CTLSTAT")
    1715                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("ERASE_CTLSTAT")
    1716                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1717                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1718                            .dwattr $C$DW$105, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1719                            .dwattr $C$DW$105, DW_AT_decl_line(0x372)
    1720                            .dwattr $C$DW$105, DW_AT_decl_column(0x11)
    1721                    
    1722                    $C$DW$106       .dwtag  DW_TAG_member
    1723                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$23)
    1724                            .dwattr $C$DW$106, DW_AT_name("ERASE_SECTADDR")
    1725                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("ERASE_SECTADDR")
    1726                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    1727                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1728                            .dwattr $C$DW$106, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1729                            .dwattr $C$DW$106, DW_AT_decl_line(0x373)
    1730                            .dwattr $C$DW$106, DW_AT_decl_column(0x11)
    1731                    
    1732                    $C$DW$107       .dwtag  DW_TAG_member
    1733                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$43)
    1734                            .dwattr $C$DW$107, DW_AT_name("RESERVED5")
    1735                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("RESERVED5")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   33

    1736                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    1737                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1738                            .dwattr $C$DW$107, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1739                            .dwattr $C$DW$107, DW_AT_decl_line(0x374)
    1740                            .dwattr $C$DW$107, DW_AT_decl_column(0x11)
    1741                    
    1742                    $C$DW$108       .dwtag  DW_TAG_member
    1743                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$23)
    1744                            .dwattr $C$DW$108, DW_AT_name("BANK0_INFO_WEPROT")
    1745                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("BANK0_INFO_WEPROT")
    1746                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1747                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1748                            .dwattr $C$DW$108, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1749                            .dwattr $C$DW$108, DW_AT_decl_line(0x375)
    1750                            .dwattr $C$DW$108, DW_AT_decl_column(0x11)
    1751                    
    1752                    $C$DW$109       .dwtag  DW_TAG_member
    1753                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$23)
    1754                            .dwattr $C$DW$109, DW_AT_name("BANK0_MAIN_WEPROT")
    1755                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("BANK0_MAIN_WEPROT")
    1756                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    1757                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1758                            .dwattr $C$DW$109, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1759                            .dwattr $C$DW$109, DW_AT_decl_line(0x376)
    1760                            .dwattr $C$DW$109, DW_AT_decl_column(0x11)
    1761                    
    1762                    $C$DW$110       .dwtag  DW_TAG_member
    1763                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$43)
    1764                            .dwattr $C$DW$110, DW_AT_name("RESERVED6")
    1765                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("RESERVED6")
    1766                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    1767                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1768                            .dwattr $C$DW$110, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1769                            .dwattr $C$DW$110, DW_AT_decl_line(0x377)
    1770                            .dwattr $C$DW$110, DW_AT_decl_column(0x11)
    1771                    
    1772                    $C$DW$111       .dwtag  DW_TAG_member
    1773                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$23)
    1774                            .dwattr $C$DW$111, DW_AT_name("BANK1_INFO_WEPROT")
    1775                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("BANK1_INFO_WEPROT")
    1776                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    1777                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1778                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1779                            .dwattr $C$DW$111, DW_AT_decl_line(0x378)
    1780                            .dwattr $C$DW$111, DW_AT_decl_column(0x11)
    1781                    
    1782                    $C$DW$112       .dwtag  DW_TAG_member
    1783                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$23)
    1784                            .dwattr $C$DW$112, DW_AT_name("BANK1_MAIN_WEPROT")
    1785                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("BANK1_MAIN_WEPROT")
    1786                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    1787                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1788                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1789                            .dwattr $C$DW$112, DW_AT_decl_line(0x379)
    1790                            .dwattr $C$DW$112, DW_AT_decl_column(0x11)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   34

    1791                    
    1792                    $C$DW$113       .dwtag  DW_TAG_member
    1793                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$43)
    1794                            .dwattr $C$DW$113, DW_AT_name("RESERVED7")
    1795                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("RESERVED7")
    1796                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    1797                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1798                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1799                            .dwattr $C$DW$113, DW_AT_decl_line(0x37a)
    1800                            .dwattr $C$DW$113, DW_AT_decl_column(0x11)
    1801                    
    1802                    $C$DW$114       .dwtag  DW_TAG_member
    1803                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$23)
    1804                            .dwattr $C$DW$114, DW_AT_name("BMRK_CTLSTAT")
    1805                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("BMRK_CTLSTAT")
    1806                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    1807                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1808                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1809                            .dwattr $C$DW$114, DW_AT_decl_line(0x37b)
    1810                            .dwattr $C$DW$114, DW_AT_decl_column(0x11)
    1811                    
    1812                    $C$DW$115       .dwtag  DW_TAG_member
    1813                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$23)
    1814                            .dwattr $C$DW$115, DW_AT_name("BMRK_IFETCH")
    1815                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("BMRK_IFETCH")
    1816                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    1817                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1818                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1819                            .dwattr $C$DW$115, DW_AT_decl_line(0x37c)
    1820                            .dwattr $C$DW$115, DW_AT_decl_column(0x11)
    1821                    
    1822                    $C$DW$116       .dwtag  DW_TAG_member
    1823                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$23)
    1824                            .dwattr $C$DW$116, DW_AT_name("BMRK_DREAD")
    1825                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("BMRK_DREAD")
    1826                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    1827                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1828                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1829                            .dwattr $C$DW$116, DW_AT_decl_line(0x37d)
    1830                            .dwattr $C$DW$116, DW_AT_decl_column(0x11)
    1831                    
    1832                    $C$DW$117       .dwtag  DW_TAG_member
    1833                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$23)
    1834                            .dwattr $C$DW$117, DW_AT_name("BMRK_CMP")
    1835                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("BMRK_CMP")
    1836                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    1837                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1838                            .dwattr $C$DW$117, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1839                            .dwattr $C$DW$117, DW_AT_decl_line(0x37e)
    1840                            .dwattr $C$DW$117, DW_AT_decl_column(0x11)
    1841                    
    1842                    $C$DW$118       .dwtag  DW_TAG_member
    1843                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$46)
    1844                            .dwattr $C$DW$118, DW_AT_name("RESERVED8")
    1845                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("RESERVED8")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:55 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
Clock.asm                                                            PAGE   35

    1846                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    1847                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1848                            .dwattr $C$DW$118, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1849                            .dwattr $C$DW$118, DW_AT_decl_line(0x37f)
    1850                            .dwattr $C$DW$118, DW_AT_decl_column(0x11)
    1851                    
    1852                    $C$DW$119       .dwtag  DW_TAG_member
    1853                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$23)
    1854                            .dwattr $C$DW$119, DW_AT_name("IFG")
    1855                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("IFG")
    1856                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    1857                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1858                            .dwattr $C$DW$119, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1859                            .dwattr $C$DW$119, DW_AT_decl_line(0x380)
    1860                            .dwattr $C$DW$119, DW_AT_decl_column(0x11)
    1861                    
    1862                    $C$DW$120       .dwtag  DW_TAG_member
    1863                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$23)
    1864                            .dwattr $C$DW$120, DW_AT_name("IE")
    1865                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("IE")
    1866                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    1867                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1868                            .dwattr $C$DW$120, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1869                            .dwattr $C$DW$120, DW_AT_decl_line(0x381)
    1870                            .dwattr $C$DW$120, DW_AT_decl_column(0x11)
    1871                    
    1872                    $C$DW$121       .dwtag  DW_TAG_member
    1873                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$23)
    1874                            .dwattr $C$DW$121, DW_AT_name("CLRIFG")
    1875                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("CLRIFG")
    1876                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
