TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                              PC v20.2.6.LTS *
       3                    ;* Date/Time created: Mon Oct 31 23:16:54 2022                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v20.2.6.LTS Copyright (c) 1996
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Y2S1\SC2107 Lab\Lab1_C_Programming\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("Clock_Delay1ms")

     803                            .dwattr $C$DW$41, DW_AT_low_pc(0x00)
     804                            .dwattr $C$DW$41, DW_AT_name("Port2_Output")
     805                            .dwattr $C$DW$41, DW_AT_TI_call
     806                    
     807 00000126 FFFEF7FF!         BL        Port2_Output          ; [DPU_V7M3_PIPE] |152|  ; [KEEP 32-BIT INS]
     808                            ; CALL OCCURS {Port2_Output }    ; [] |152| 
     809                            .dwpsn  file "../main.c",line 157,column 9,is_stmt,isa 1
     810 0000012a 2001              MOVS      A1, #1                ; [DPU_V7M3_PIPE] |157|  ; [ORIG 16-BIT INS]
     811                    $C$DW$42        .dwtag  DW_TAG_TI_branch
     812                            .dwattr $C$DW$42, DW_AT_low_pc(0x00)
     813                            .dwattr $C$DW$42, DW_AT_name("Port1_Output")
     814                            .dwattr $C$DW$42, DW_AT_TI_call
     815                    
     816 0000012c FFFEF7FF!         BL        Port1_Output          ; [DPU_V7M3_PIPE] |157|  ; [KEEP 32-BIT INS]
     817                            ; CALL OCCURS {Port1_Output }    ; [] |157| 
     818                            .dwpsn  file "../main.c",line 158,column 9,is_stmt,isa 1
     819 00000130 E7EE              B         ||$C$L7||             ; [DPU_V7M3_PIPE] |158|  ; [ORIG 16-BIT INS]
     820                            ; BRANCH OCCURS {||$C$L7||}      ; [] |158| 
     821                    ;* --------------------------------------------------------------------------*
     822                            .dwattr $C$DW$29, DW_AT_TI_end_file("../main.c")
     823                            .dwattr $C$DW$29, DW_AT_TI_end_line(0xa5)
     824                            .dwattr $C$DW$29, DW_AT_TI_end_column(0x01)
     825                            .dwendentry
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   16

     826                            .dwendtag $C$DW$29
     827                    
     828                    ;******************************************************************************
     829                    ;* CONSTANT TABLE                                                             *
     830                    ;******************************************************************************
     831 00000132                   .sect   ".text"
     832                            .align  4
     833 00000132 4C0C46C0  ||$C$CON2||:    .bits           0x40004c0c,32
         00000136 00004000 
     834                    
     835                            .align  4
     836 00000136 4C024000  ||$C$CON5||:    .bits           0x40004c02,32
         0000013a 00004000 
     837                    
     838                            .align  4
     839 0000013a 4C034000  ||$C$CON10||:   .bits           0x40004c03,32
         0000013e 00004000 
     840                    
     841                            .align  4
     842 0000013e 00004000! ||$C$CON11||:   .bits   ||$P$T0$1||,32
         00000142 00000000 
     843                    ;*****************************************************************************
     844                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
     845                    ;*****************************************************************************
     846                            .global Clock_Delay1ms
     847                    
     848                    ;******************************************************************************
     849                    ;* BUILD ATTRIBUTES                                                           *
     850                    ;******************************************************************************
     851                            .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     852                            .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0111111111100000000000000
     853                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     854                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     855                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     856                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     857                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     858                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     859                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(3)
     860                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     861                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     862                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     863                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     864                    
     865                    ;******************************************************************************
     866                    ;* TYPE INFORMATION                                                           *
     867                    ;******************************************************************************
     868                    
     869                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
     870                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1e)
     871                    $C$DW$43        .dwtag  DW_TAG_member
     872                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$23)
     873                            .dwattr $C$DW$43, DW_AT_name("IN")
     874                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("IN")
     875                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     876                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   17

     877                            .dwattr $C$DW$43, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     878                            .dwattr $C$DW$43, DW_AT_decl_line(0x288)
     879                            .dwattr $C$DW$43, DW_AT_decl_column(0x0f)
     880                    
     881                    $C$DW$44        .dwtag  DW_TAG_member
     882                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$22)
     883                            .dwattr $C$DW$44, DW_AT_name("RESERVED0")
     884                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("RESERVED0")
     885                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     886                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     887                            .dwattr $C$DW$44, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     888                            .dwattr $C$DW$44, DW_AT_decl_line(0x289)
     889                            .dwattr $C$DW$44, DW_AT_decl_column(0x0b)
     890                    
     891                    $C$DW$45        .dwtag  DW_TAG_member
     892                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$24)
     893                            .dwattr $C$DW$45, DW_AT_name("OUT")
     894                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("OUT")
     895                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     896                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     897                            .dwattr $C$DW$45, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     898                            .dwattr $C$DW$45, DW_AT_decl_line(0x28a)
     899                            .dwattr $C$DW$45, DW_AT_decl_column(0x10)
     900                    
     901                    $C$DW$46        .dwtag  DW_TAG_member
     902                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$22)
     903                            .dwattr $C$DW$46, DW_AT_name("RESERVED1")
     904                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("RESERVED1")
     905                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     906                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     907                            .dwattr $C$DW$46, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     908                            .dwattr $C$DW$46, DW_AT_decl_line(0x28b)
     909                            .dwattr $C$DW$46, DW_AT_decl_column(0x0b)
     910                    
     911                    $C$DW$47        .dwtag  DW_TAG_member
     912                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$24)
     913                            .dwattr $C$DW$47, DW_AT_name("DIR")
     914                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("DIR")
     915                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     916                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     917                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     918                            .dwattr $C$DW$47, DW_AT_decl_line(0x28c)
     919                            .dwattr $C$DW$47, DW_AT_decl_column(0x10)
     920                    
     921                    $C$DW$48        .dwtag  DW_TAG_member
     922                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$22)
     923                            .dwattr $C$DW$48, DW_AT_name("RESERVED2")
     924                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("RESERVED2")
     925                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     926                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     927                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     928                            .dwattr $C$DW$48, DW_AT_decl_line(0x28d)
     929                            .dwattr $C$DW$48, DW_AT_decl_column(0x0b)
     930                    
     931                    $C$DW$49        .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   18

     932                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$24)
     933                            .dwattr $C$DW$49, DW_AT_name("REN")
     934                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("REN")
     935                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     936                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     937                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     938                            .dwattr $C$DW$49, DW_AT_decl_line(0x28e)
     939                            .dwattr $C$DW$49, DW_AT_decl_column(0x10)
     940                    
     941                    $C$DW$50        .dwtag  DW_TAG_member
     942                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$22)
     943                            .dwattr $C$DW$50, DW_AT_name("RESERVED3")
     944                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("RESERVED3")
     945                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     946                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     947                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     948                            .dwattr $C$DW$50, DW_AT_decl_line(0x28f)
     949                            .dwattr $C$DW$50, DW_AT_decl_column(0x0b)
     950                    
     951                    $C$DW$51        .dwtag  DW_TAG_member
     952                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$24)
     953                            .dwattr $C$DW$51, DW_AT_name("DS")
     954                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("DS")
     955                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     956                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     957                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     958                            .dwattr $C$DW$51, DW_AT_decl_line(0x290)
     959                            .dwattr $C$DW$51, DW_AT_decl_column(0x10)
     960                    
     961                    $C$DW$52        .dwtag  DW_TAG_member
     962                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$22)
     963                            .dwattr $C$DW$52, DW_AT_name("RESERVED4")
     964                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("RESERVED4")
     965                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     966                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     967                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     968                            .dwattr $C$DW$52, DW_AT_decl_line(0x291)
     969                            .dwattr $C$DW$52, DW_AT_decl_column(0x0b)
     970                    
     971                    $C$DW$53        .dwtag  DW_TAG_member
     972                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$24)
     973                            .dwattr $C$DW$53, DW_AT_name("SEL0")
     974                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("SEL0")
     975                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     976                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     977                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     978                            .dwattr $C$DW$53, DW_AT_decl_line(0x292)
     979                            .dwattr $C$DW$53, DW_AT_decl_column(0x10)
     980                    
     981                    $C$DW$54        .dwtag  DW_TAG_member
     982                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$22)
     983                            .dwattr $C$DW$54, DW_AT_name("RESERVED5")
     984                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("RESERVED5")
     985                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     986                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   19

     987                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     988                            .dwattr $C$DW$54, DW_AT_decl_line(0x293)
     989                            .dwattr $C$DW$54, DW_AT_decl_column(0x0b)
     990                    
     991                    $C$DW$55        .dwtag  DW_TAG_member
     992                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$24)
     993                            .dwattr $C$DW$55, DW_AT_name("SEL1")
     994                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("SEL1")
     995                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     996                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     997                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     998                            .dwattr $C$DW$55, DW_AT_decl_line(0x294)
     999                            .dwattr $C$DW$55, DW_AT_decl_column(0x10)
    1000                    
    1001                    $C$DW$56        .dwtag  DW_TAG_member
    1002                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$22)
    1003                            .dwattr $C$DW$56, DW_AT_name("RESERVED6")
    1004                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("RESERVED6")
    1005                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1006                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1007                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1008                            .dwattr $C$DW$56, DW_AT_decl_line(0x295)
    1009                            .dwattr $C$DW$56, DW_AT_decl_column(0x0b)
    1010                    
    1011                    $C$DW$57        .dwtag  DW_TAG_member
    1012                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$27)
    1013                            .dwattr $C$DW$57, DW_AT_name("IV")
    1014                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("IV")
    1015                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1016                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1017                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1018                            .dwattr $C$DW$57, DW_AT_decl_line(0x296)
    1019                            .dwattr $C$DW$57, DW_AT_decl_column(0x11)
    1020                    
    1021                    $C$DW$58        .dwtag  DW_TAG_member
    1022                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$28)
    1023                            .dwattr $C$DW$58, DW_AT_name("RESERVED7")
    1024                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("RESERVED7")
    1025                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1026                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1027                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1028                            .dwattr $C$DW$58, DW_AT_decl_line(0x297)
    1029                            .dwattr $C$DW$58, DW_AT_decl_column(0x0b)
    1030                    
    1031                    $C$DW$59        .dwtag  DW_TAG_member
    1032                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$24)
    1033                            .dwattr $C$DW$59, DW_AT_name("SELC")
    1034                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("SELC")
    1035                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1036                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1037                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1038                            .dwattr $C$DW$59, DW_AT_decl_line(0x298)
    1039                            .dwattr $C$DW$59, DW_AT_decl_column(0x10)
    1040                    
    1041                    $C$DW$60        .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   20

    1042                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$22)
    1043                            .dwattr $C$DW$60, DW_AT_name("RESERVED8")
    1044                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("RESERVED8")
    1045                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1046                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1047                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1048                            .dwattr $C$DW$60, DW_AT_decl_line(0x299)
    1049                            .dwattr $C$DW$60, DW_AT_decl_column(0x0b)
    1050                    
    1051                    $C$DW$61        .dwtag  DW_TAG_member
    1052                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$24)
    1053                            .dwattr $C$DW$61, DW_AT_name("IES")
    1054                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("IES")
    1055                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1056                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1057                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1058                            .dwattr $C$DW$61, DW_AT_decl_line(0x29a)
    1059                            .dwattr $C$DW$61, DW_AT_decl_column(0x10)
    1060                    
    1061                    $C$DW$62        .dwtag  DW_TAG_member
    1062                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$22)
    1063                            .dwattr $C$DW$62, DW_AT_name("RESERVED9")
    1064                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("RESERVED9")
    1065                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1066                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1067                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1068                            .dwattr $C$DW$62, DW_AT_decl_line(0x29b)
    1069                            .dwattr $C$DW$62, DW_AT_decl_column(0x0b)
    1070                    
    1071                    $C$DW$63        .dwtag  DW_TAG_member
    1072                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$24)
    1073                            .dwattr $C$DW$63, DW_AT_name("IE")
    1074                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("IE")
    1075                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1076                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1077                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1078                            .dwattr $C$DW$63, DW_AT_decl_line(0x29c)
    1079                            .dwattr $C$DW$63, DW_AT_decl_column(0x10)
    1080                    
    1081                    $C$DW$64        .dwtag  DW_TAG_member
    1082                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$22)
    1083                            .dwattr $C$DW$64, DW_AT_name("RESERVED10")
    1084                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("RESERVED10")
    1085                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1086                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1087                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1088                            .dwattr $C$DW$64, DW_AT_decl_line(0x29d)
    1089                            .dwattr $C$DW$64, DW_AT_decl_column(0x0b)
    1090                    
    1091                    $C$DW$65        .dwtag  DW_TAG_member
    1092                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$24)
    1093                            .dwattr $C$DW$65, DW_AT_name("IFG")
    1094                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("IFG")
    1095                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1096                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   21

    1097                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1098                            .dwattr $C$DW$65, DW_AT_decl_line(0x29e)
    1099                            .dwattr $C$DW$65, DW_AT_decl_column(0x10)
    1100                    
    1101                    $C$DW$66        .dwtag  DW_TAG_member
    1102                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$22)
    1103                            .dwattr $C$DW$66, DW_AT_name("RESERVED11")
    1104                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("RESERVED11")
    1105                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1106                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1107                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1108                            .dwattr $C$DW$66, DW_AT_decl_line(0x29f)
    1109                            .dwattr $C$DW$66, DW_AT_decl_column(0x0b)
    1110                    
    1111                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1112                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x287)
    1113                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    1114                            .dwendtag $C$DW$T$29
    1115                    
    1116                    $C$DW$T$179     .dwtag  DW_TAG_typedef
    1117                            .dwattr $C$DW$T$179, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
    1118                            .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$29)
    1119                            .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    1120                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1121                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x2a0)
    1122                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x03)
    1123                    
    1124                    
    1125                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1126                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x20)
    1127                    $C$DW$67        .dwtag  DW_TAG_member
    1128                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$22)
    1129                            .dwattr $C$DW$67, DW_AT_name("RESERVED0")
    1130                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("RESERVED0")
    1131                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1132                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1133                            .dwattr $C$DW$67, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1134                            .dwattr $C$DW$67, DW_AT_decl_line(0x2a3)
    1135                            .dwattr $C$DW$67, DW_AT_decl_column(0x0b)
    1136                    
    1137                    $C$DW$68        .dwtag  DW_TAG_member
    1138                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$23)
    1139                            .dwattr $C$DW$68, DW_AT_name("IN")
    1140                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("IN")
    1141                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1142                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1143                            .dwattr $C$DW$68, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1144                            .dwattr $C$DW$68, DW_AT_decl_line(0x2a4)
    1145                            .dwattr $C$DW$68, DW_AT_decl_column(0x0f)
    1146                    
    1147                    $C$DW$69        .dwtag  DW_TAG_member
    1148                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$22)
    1149                            .dwattr $C$DW$69, DW_AT_name("RESERVED1")
    1150                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("RESERVED1")
    1151                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   22

    1152                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1153                            .dwattr $C$DW$69, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1154                            .dwattr $C$DW$69, DW_AT_decl_line(0x2a5)
    1155                            .dwattr $C$DW$69, DW_AT_decl_column(0x0b)
    1156                    
    1157                    $C$DW$70        .dwtag  DW_TAG_member
    1158                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$24)
    1159                            .dwattr $C$DW$70, DW_AT_name("OUT")
    1160                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("OUT")
    1161                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1162                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1163                            .dwattr $C$DW$70, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1164                            .dwattr $C$DW$70, DW_AT_decl_line(0x2a6)
    1165                            .dwattr $C$DW$70, DW_AT_decl_column(0x10)
    1166                    
    1167                    $C$DW$71        .dwtag  DW_TAG_member
    1168                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$22)
    1169                            .dwattr $C$DW$71, DW_AT_name("RESERVED2")
    1170                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("RESERVED2")
    1171                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1172                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1173                            .dwattr $C$DW$71, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1174                            .dwattr $C$DW$71, DW_AT_decl_line(0x2a7)
    1175                            .dwattr $C$DW$71, DW_AT_decl_column(0x0b)
    1176                    
    1177                    $C$DW$72        .dwtag  DW_TAG_member
    1178                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$24)
    1179                            .dwattr $C$DW$72, DW_AT_name("DIR")
    1180                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("DIR")
    1181                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1182                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1183                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1184                            .dwattr $C$DW$72, DW_AT_decl_line(0x2a8)
    1185                            .dwattr $C$DW$72, DW_AT_decl_column(0x10)
    1186                    
    1187                    $C$DW$73        .dwtag  DW_TAG_member
    1188                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$22)
    1189                            .dwattr $C$DW$73, DW_AT_name("RESERVED3")
    1190                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("RESERVED3")
    1191                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1192                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1193                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1194                            .dwattr $C$DW$73, DW_AT_decl_line(0x2a9)
    1195                            .dwattr $C$DW$73, DW_AT_decl_column(0x0b)
    1196                    
    1197                    $C$DW$74        .dwtag  DW_TAG_member
    1198                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$24)
    1199                            .dwattr $C$DW$74, DW_AT_name("REN")
    1200                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("REN")
    1201                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1202                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1203                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1204                            .dwattr $C$DW$74, DW_AT_decl_line(0x2aa)
    1205                            .dwattr $C$DW$74, DW_AT_decl_column(0x10)
    1206                    
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   23

    1207                    $C$DW$75        .dwtag  DW_TAG_member
    1208                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$22)
    1209                            .dwattr $C$DW$75, DW_AT_name("RESERVED4")
    1210                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("RESERVED4")
    1211                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1212                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1213                            .dwattr $C$DW$75, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1214                            .dwattr $C$DW$75, DW_AT_decl_line(0x2ab)
    1215                            .dwattr $C$DW$75, DW_AT_decl_column(0x0b)
    1216                    
    1217                    $C$DW$76        .dwtag  DW_TAG_member
    1218                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$24)
    1219                            .dwattr $C$DW$76, DW_AT_name("DS")
    1220                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("DS")
    1221                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1222                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1223                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1224                            .dwattr $C$DW$76, DW_AT_decl_line(0x2ac)
    1225                            .dwattr $C$DW$76, DW_AT_decl_column(0x10)
    1226                    
    1227                    $C$DW$77        .dwtag  DW_TAG_member
    1228                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$22)
    1229                            .dwattr $C$DW$77, DW_AT_name("RESERVED5")
    1230                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("RESERVED5")
    1231                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1232                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1233                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1234                            .dwattr $C$DW$77, DW_AT_decl_line(0x2ad)
    1235                            .dwattr $C$DW$77, DW_AT_decl_column(0x0b)
    1236                    
    1237                    $C$DW$78        .dwtag  DW_TAG_member
    1238                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$24)
    1239                            .dwattr $C$DW$78, DW_AT_name("SEL0")
    1240                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("SEL0")
    1241                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1242                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1243                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1244                            .dwattr $C$DW$78, DW_AT_decl_line(0x2ae)
    1245                            .dwattr $C$DW$78, DW_AT_decl_column(0x10)
    1246                    
    1247                    $C$DW$79        .dwtag  DW_TAG_member
    1248                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$22)
    1249                            .dwattr $C$DW$79, DW_AT_name("RESERVED6")
    1250                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("RESERVED6")
    1251                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1252                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1253                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1254                            .dwattr $C$DW$79, DW_AT_decl_line(0x2af)
    1255                            .dwattr $C$DW$79, DW_AT_decl_column(0x0b)
    1256                    
    1257                    $C$DW$80        .dwtag  DW_TAG_member
    1258                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$24)
    1259                            .dwattr $C$DW$80, DW_AT_name("SEL1")
    1260                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("SEL1")
    1261                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   24

    1262                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1263                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1264                            .dwattr $C$DW$80, DW_AT_decl_line(0x2b0)
    1265                            .dwattr $C$DW$80, DW_AT_decl_column(0x10)
    1266                    
    1267                    $C$DW$81        .dwtag  DW_TAG_member
    1268                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$30)
    1269                            .dwattr $C$DW$81, DW_AT_name("RESERVED7")
    1270                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("RESERVED7")
    1271                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1272                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1273                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1274                            .dwattr $C$DW$81, DW_AT_decl_line(0x2b1)
    1275                            .dwattr $C$DW$81, DW_AT_decl_column(0x0b)
    1276                    
    1277                    $C$DW$82        .dwtag  DW_TAG_member
    1278                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$24)
    1279                            .dwattr $C$DW$82, DW_AT_name("SELC")
    1280                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("SELC")
    1281                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1282                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1283                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1284                            .dwattr $C$DW$82, DW_AT_decl_line(0x2b2)
    1285                            .dwattr $C$DW$82, DW_AT_decl_column(0x10)
    1286                    
    1287                    $C$DW$83        .dwtag  DW_TAG_member
    1288                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$22)
    1289                            .dwattr $C$DW$83, DW_AT_name("RESERVED8")
    1290                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("RESERVED8")
    1291                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1292                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1293                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1294                            .dwattr $C$DW$83, DW_AT_decl_line(0x2b3)
    1295                            .dwattr $C$DW$83, DW_AT_decl_column(0x0b)
    1296                    
    1297                    $C$DW$84        .dwtag  DW_TAG_member
    1298                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$24)
    1299                            .dwattr $C$DW$84, DW_AT_name("IES")
    1300                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("IES")
    1301                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1302                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1303                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1304                            .dwattr $C$DW$84, DW_AT_decl_line(0x2b4)
    1305                            .dwattr $C$DW$84, DW_AT_decl_column(0x10)
    1306                    
    1307                    $C$DW$85        .dwtag  DW_TAG_member
    1308                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$22)
    1309                            .dwattr $C$DW$85, DW_AT_name("RESERVED9")
    1310                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("RESERVED9")
    1311                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1312                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1313                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1314                            .dwattr $C$DW$85, DW_AT_decl_line(0x2b5)
    1315                            .dwattr $C$DW$85, DW_AT_decl_column(0x0b)
    1316                    
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   25

    1317                    $C$DW$86        .dwtag  DW_TAG_member
    1318                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$24)
    1319                            .dwattr $C$DW$86, DW_AT_name("IE")
    1320                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("IE")
    1321                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1322                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1323                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1324                            .dwattr $C$DW$86, DW_AT_decl_line(0x2b6)
    1325                            .dwattr $C$DW$86, DW_AT_decl_column(0x10)
    1326                    
    1327                    $C$DW$87        .dwtag  DW_TAG_member
    1328                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$22)
    1329                            .dwattr $C$DW$87, DW_AT_name("RESERVED10")
    1330                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("RESERVED10")
    1331                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1332                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1333                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1334                            .dwattr $C$DW$87, DW_AT_decl_line(0x2b7)
    1335                            .dwattr $C$DW$87, DW_AT_decl_column(0x0b)
    1336                    
    1337                    $C$DW$88        .dwtag  DW_TAG_member
    1338                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$24)
    1339                            .dwattr $C$DW$88, DW_AT_name("IFG")
    1340                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("IFG")
    1341                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1342                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1343                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1344                            .dwattr $C$DW$88, DW_AT_decl_line(0x2b8)
    1345                            .dwattr $C$DW$88, DW_AT_decl_column(0x10)
    1346                    
    1347                    $C$DW$89        .dwtag  DW_TAG_member
    1348                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$27)
    1349                            .dwattr $C$DW$89, DW_AT_name("IV")
    1350                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("IV")
    1351                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1352                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1353                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1354                            .dwattr $C$DW$89, DW_AT_decl_line(0x2b9)
    1355                            .dwattr $C$DW$89, DW_AT_decl_column(0x10)
    1356                    
    1357                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1358                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x2a2)
    1359                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    1360                            .dwendtag $C$DW$T$31
    1361                    
    1362                    $C$DW$T$181     .dwtag  DW_TAG_typedef
    1363                            .dwattr $C$DW$T$181, DW_AT_name("DIO_PORT_Even_Interruptable_Type")
    1364                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$31)
    1365                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    1366                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1367                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x2ba)
    1368                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x03)
    1369                    
    1370                    
    1371                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   26

    1372                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    1373                    $C$DW$90        .dwtag  DW_TAG_member
    1374                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$14)
    1375                            .dwattr $C$DW$90, DW_AT_name("__max_align1")
    1376                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("__max_align1")
    1377                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1379                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/ccs1200/ccs/tools/compiler/ti-cgt-arm_20.2.6.LTS/incl
    1380                            .dwattr $C$DW$90, DW_AT_decl_line(0x7b)
    1381                            .dwattr $C$DW$90, DW_AT_decl_column(0x0c)
    1382                    
    1383                    $C$DW$91        .dwtag  DW_TAG_member
    1384                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$18)
    1385                            .dwattr $C$DW$91, DW_AT_name("__max_align2")
    1386                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("__max_align2")
    1387                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1388                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1389                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/ccs1200/ccs/tools/compiler/ti-cgt-arm_20.2.6.LTS/incl
    1390                            .dwattr $C$DW$91, DW_AT_decl_line(0x7c)
    1391                            .dwattr $C$DW$91, DW_AT_decl_column(0x0e)
    1392                    
    1393                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/ccs1200/ccs/tools/compiler/ti-cgt-arm_20.2.6.LTS/in
    1394                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7a)
    1395                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    1396                            .dwendtag $C$DW$T$32
    1397                    
    1398                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    1399                            .dwattr $C$DW$T$183, DW_AT_name("__max_align_t")
    1400                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$32)
    1401                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    1402                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/ccs1200/ccs/tools/compiler/ti-cgt-arm_20.2.6.LTS/i
    1403                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x7d)
    1404                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x03)
    1405                    
    1406                    
    1407                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1408                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    1409                    $C$DW$92        .dwtag  DW_TAG_member
    1410                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$34)
    1411                            .dwattr $C$DW$92, DW_AT_name("_reserved0")
    1412                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("_reserved0")
    1413                            .dwattr $C$DW$92, DW_AT_bit_offset(0x10)
    1414                            .dwattr $C$DW$92, DW_AT_bit_size(0x10)
    1415                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1417                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1418                            .dwattr $C$DW$92, DW_AT_decl_line(0x105)
    1419                            .dwattr $C$DW$92, DW_AT_decl_column(0x0e)
    1420                    
    1421                    $C$DW$93        .dwtag  DW_TAG_member
    1422                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$34)
    1423                            .dwattr $C$DW$93, DW_AT_name("GE")
    1424                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("GE")
    1425                            .dwattr $C$DW$93, DW_AT_bit_offset(0x0c)
    1426                            .dwattr $C$DW$93, DW_AT_bit_size(0x04)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   27

    1427                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1429                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1430                            .dwattr $C$DW$93, DW_AT_decl_line(0x106)
    1431                            .dwattr $C$DW$93, DW_AT_decl_column(0x0e)
    1432                    
    1433                    $C$DW$94        .dwtag  DW_TAG_member
    1434                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$34)
    1435                            .dwattr $C$DW$94, DW_AT_name("_reserved1")
    1436                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("_reserved1")
    1437                            .dwattr $C$DW$94, DW_AT_bit_offset(0x05)
    1438                            .dwattr $C$DW$94, DW_AT_bit_size(0x07)
    1439                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1441                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1442                            .dwattr $C$DW$94, DW_AT_decl_line(0x107)
    1443                            .dwattr $C$DW$94, DW_AT_decl_column(0x0e)
    1444                    
    1445                    $C$DW$95        .dwtag  DW_TAG_member
    1446                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$34)
    1447                            .dwattr $C$DW$95, DW_AT_name("Q")
    1448                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("Q")
    1449                            .dwattr $C$DW$95, DW_AT_bit_offset(0x04)
    1450                            .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1451                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1453                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1454                            .dwattr $C$DW$95, DW_AT_decl_line(0x108)
    1455                            .dwattr $C$DW$95, DW_AT_decl_column(0x0e)
    1456                    
    1457                    $C$DW$96        .dwtag  DW_TAG_member
    1458                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$34)
    1459                            .dwattr $C$DW$96, DW_AT_name("V")
    1460                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("V")
    1461                            .dwattr $C$DW$96, DW_AT_bit_offset(0x03)
    1462                            .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1463                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1464                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1465                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1466                            .dwattr $C$DW$96, DW_AT_decl_line(0x109)
    1467                            .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1468                    
    1469                    $C$DW$97        .dwtag  DW_TAG_member
    1470                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$34)
    1471                            .dwattr $C$DW$97, DW_AT_name("C")
    1472                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("C")
    1473                            .dwattr $C$DW$97, DW_AT_bit_offset(0x02)
    1474                            .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1475                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1477                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1478                            .dwattr $C$DW$97, DW_AT_decl_line(0x10a)
    1479                            .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1480                    
    1481                    $C$DW$98        .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   28

    1482                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$34)
    1483                            .dwattr $C$DW$98, DW_AT_name("Z")
    1484                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("Z")
    1485                            .dwattr $C$DW$98, DW_AT_bit_offset(0x01)
    1486                            .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1487                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1488                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1489                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1490                            .dwattr $C$DW$98, DW_AT_decl_line(0x10b)
    1491                            .dwattr $C$DW$98, DW_AT_decl_column(0x0e)
    1492                    
    1493                    $C$DW$99        .dwtag  DW_TAG_member
    1494                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$34)
    1495                            .dwattr $C$DW$99, DW_AT_name("N")
    1496                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("N")
    1497                            .dwattr $C$DW$99, DW_AT_bit_offset(0x00)
    1498                            .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1499                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1501                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1502                            .dwattr $C$DW$99, DW_AT_decl_line(0x10c)
    1503                            .dwattr $C$DW$99, DW_AT_decl_column(0x0e)
    1504                    
    1505                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1506                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x104)
    1507                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    1508                            .dwendtag $C$DW$T$35
    1509                    
    1510                    
    1511                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1512                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1513                    $C$DW$100       .dwtag  DW_TAG_member
    1514                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$34)
    1515                            .dwattr $C$DW$100, DW_AT_name("ISR")
    1516                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("ISR")
    1517                            .dwattr $C$DW$100, DW_AT_bit_offset(0x17)
    1518                            .dwattr $C$DW$100, DW_AT_bit_size(0x09)
    1519                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1520                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1521                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1522                            .dwattr $C$DW$100, DW_AT_decl_line(0x12c)
    1523                            .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1524                    
    1525                    $C$DW$101       .dwtag  DW_TAG_member
    1526                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$34)
    1527                            .dwattr $C$DW$101, DW_AT_name("_reserved0")
    1528                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("_reserved0")
    1529                            .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1530                            .dwattr $C$DW$101, DW_AT_bit_size(0x17)
    1531                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1532                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1533                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1534                            .dwattr $C$DW$101, DW_AT_decl_line(0x12d)
    1535                            .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1536                    
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   29

    1537                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1538                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x12b)
    1539                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
    1540                            .dwendtag $C$DW$T$36
    1541                    
    1542                    
    1543                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1544                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1545                    $C$DW$102       .dwtag  DW_TAG_member
    1546                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$34)
    1547                            .dwattr $C$DW$102, DW_AT_name("ISR")
    1548                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("ISR")
    1549                            .dwattr $C$DW$102, DW_AT_bit_offset(0x17)
    1550                            .dwattr $C$DW$102, DW_AT_bit_size(0x09)
    1551                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1552                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1553                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1554                            .dwattr $C$DW$102, DW_AT_decl_line(0x13e)
    1555                            .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    1556                    
    1557                    $C$DW$103       .dwtag  DW_TAG_member
    1558                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$34)
    1559                            .dwattr $C$DW$103, DW_AT_name("_reserved0")
    1560                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("_reserved0")
    1561                            .dwattr $C$DW$103, DW_AT_bit_offset(0x16)
    1562                            .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1563                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1564                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1565                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1566                            .dwattr $C$DW$103, DW_AT_decl_line(0x13f)
    1567                            .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    1568                    
    1569                    $C$DW$104       .dwtag  DW_TAG_member
    1570                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$34)
    1571                            .dwattr $C$DW$104, DW_AT_name("ICI_IT_1")
    1572                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("ICI_IT_1")
    1573                            .dwattr $C$DW$104, DW_AT_bit_offset(0x10)
    1574                            .dwattr $C$DW$104, DW_AT_bit_size(0x06)
    1575                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1576                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1577                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1578                            .dwattr $C$DW$104, DW_AT_decl_line(0x140)
    1579                            .dwattr $C$DW$104, DW_AT_decl_column(0x0e)
    1580                    
    1581                    $C$DW$105       .dwtag  DW_TAG_member
    1582                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$34)
    1583                            .dwattr $C$DW$105, DW_AT_name("GE")
    1584                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("GE")
    1585                            .dwattr $C$DW$105, DW_AT_bit_offset(0x0c)
    1586                            .dwattr $C$DW$105, DW_AT_bit_size(0x04)
    1587                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1588                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1589                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1590                            .dwattr $C$DW$105, DW_AT_decl_line(0x141)
    1591                            .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   30

    1592                    
    1593                    $C$DW$106       .dwtag  DW_TAG_member
    1594                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$34)
    1595                            .dwattr $C$DW$106, DW_AT_name("_reserved1")
    1596                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("_reserved1")
    1597                            .dwattr $C$DW$106, DW_AT_bit_offset(0x08)
    1598                            .dwattr $C$DW$106, DW_AT_bit_size(0x04)
    1599                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1600                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1601                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1602                            .dwattr $C$DW$106, DW_AT_decl_line(0x142)
    1603                            .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1604                    
    1605                    $C$DW$107       .dwtag  DW_TAG_member
    1606                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$34)
    1607                            .dwattr $C$DW$107, DW_AT_name("T")
    1608                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("T")
    1609                            .dwattr $C$DW$107, DW_AT_bit_offset(0x07)
    1610                            .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1611                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1613                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1614                            .dwattr $C$DW$107, DW_AT_decl_line(0x143)
    1615                            .dwattr $C$DW$107, DW_AT_decl_column(0x0e)
    1616                    
    1617                    $C$DW$108       .dwtag  DW_TAG_member
    1618                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$34)
    1619                            .dwattr $C$DW$108, DW_AT_name("ICI_IT_2")
    1620                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("ICI_IT_2")
    1621                            .dwattr $C$DW$108, DW_AT_bit_offset(0x05)
    1622                            .dwattr $C$DW$108, DW_AT_bit_size(0x02)
    1623                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1624                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1625                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1626                            .dwattr $C$DW$108, DW_AT_decl_line(0x144)
    1627                            .dwattr $C$DW$108, DW_AT_decl_column(0x0e)
    1628                    
    1629                    $C$DW$109       .dwtag  DW_TAG_member
    1630                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$34)
    1631                            .dwattr $C$DW$109, DW_AT_name("Q")
    1632                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("Q")
    1633                            .dwattr $C$DW$109, DW_AT_bit_offset(0x04)
    1634                            .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1635                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1637                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1638                            .dwattr $C$DW$109, DW_AT_decl_line(0x145)
    1639                            .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    1640                    
    1641                    $C$DW$110       .dwtag  DW_TAG_member
    1642                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$34)
    1643                            .dwattr $C$DW$110, DW_AT_name("V")
    1644                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("V")
    1645                            .dwattr $C$DW$110, DW_AT_bit_offset(0x03)
    1646                            .dwattr $C$DW$110, DW_AT_bit_size(0x01)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   31

    1647                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1649                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1650                            .dwattr $C$DW$110, DW_AT_decl_line(0x146)
    1651                            .dwattr $C$DW$110, DW_AT_decl_column(0x0e)
    1652                    
    1653                    $C$DW$111       .dwtag  DW_TAG_member
    1654                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$34)
    1655                            .dwattr $C$DW$111, DW_AT_name("C")
    1656                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("C")
    1657                            .dwattr $C$DW$111, DW_AT_bit_offset(0x02)
    1658                            .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1659                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1661                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1662                            .dwattr $C$DW$111, DW_AT_decl_line(0x147)
    1663                            .dwattr $C$DW$111, DW_AT_decl_column(0x0e)
    1664                    
    1665                    $C$DW$112       .dwtag  DW_TAG_member
    1666                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$34)
    1667                            .dwattr $C$DW$112, DW_AT_name("Z")
    1668                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("Z")
    1669                            .dwattr $C$DW$112, DW_AT_bit_offset(0x01)
    1670                            .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1671                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1673                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1674                            .dwattr $C$DW$112, DW_AT_decl_line(0x148)
    1675                            .dwattr $C$DW$112, DW_AT_decl_column(0x0e)
    1676                    
    1677                    $C$DW$113       .dwtag  DW_TAG_member
    1678                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$34)
    1679                            .dwattr $C$DW$113, DW_AT_name("N")
    1680                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("N")
    1681                            .dwattr $C$DW$113, DW_AT_bit_offset(0x00)
    1682                            .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1683                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1685                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1686                            .dwattr $C$DW$113, DW_AT_decl_line(0x149)
    1687                            .dwattr $C$DW$113, DW_AT_decl_column(0x0e)
    1688                    
    1689                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1690                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x13d)
    1691                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    1692                            .dwendtag $C$DW$T$37
    1693                    
    1694                    
    1695                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1696                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1697                    $C$DW$114       .dwtag  DW_TAG_member
    1698                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$34)
    1699                            .dwattr $C$DW$114, DW_AT_name("nPRIV")
    1700                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("nPRIV")
    1701                            .dwattr $C$DW$114, DW_AT_bit_offset(0x1f)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   32

    1702                            .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1703                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1705                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1706                            .dwattr $C$DW$114, DW_AT_decl_line(0x175)
    1707                            .dwattr $C$DW$114, DW_AT_decl_column(0x0e)
    1708                    
    1709                    $C$DW$115       .dwtag  DW_TAG_member
    1710                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$34)
    1711                            .dwattr $C$DW$115, DW_AT_name("SPSEL")
    1712                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("SPSEL")
    1713                            .dwattr $C$DW$115, DW_AT_bit_offset(0x1e)
    1714                            .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1715                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1716                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1717                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1718                            .dwattr $C$DW$115, DW_AT_decl_line(0x176)
    1719                            .dwattr $C$DW$115, DW_AT_decl_column(0x0e)
    1720                    
    1721                    $C$DW$116       .dwtag  DW_TAG_member
    1722                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$34)
    1723                            .dwattr $C$DW$116, DW_AT_name("FPCA")
    1724                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("FPCA")
    1725                            .dwattr $C$DW$116, DW_AT_bit_offset(0x1d)
    1726                            .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1727                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1728                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1729                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1730                            .dwattr $C$DW$116, DW_AT_decl_line(0x177)
    1731                            .dwattr $C$DW$116, DW_AT_decl_column(0x0e)
    1732                    
    1733                    $C$DW$117       .dwtag  DW_TAG_member
    1734                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$34)
    1735                            .dwattr $C$DW$117, DW_AT_name("_reserved0")
    1736                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("_reserved0")
    1737                            .dwattr $C$DW$117, DW_AT_bit_offset(0x00)
    1738                            .dwattr $C$DW$117, DW_AT_bit_size(0x1d)
    1739                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1740                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1741                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1742                            .dwattr $C$DW$117, DW_AT_decl_line(0x178)
    1743                            .dwattr $C$DW$117, DW_AT_decl_column(0x0e)
    1744                    
    1745                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1746                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x174)
    1747                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    1748                            .dwendtag $C$DW$T$38
    1749                    
    1750                    
    1751                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1752                            .dwattr $C$DW$T$45, DW_AT_byte_size(0xe04)
    1753                    $C$DW$118       .dwtag  DW_TAG_member
    1754                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$40)
    1755                            .dwattr $C$DW$118, DW_AT_name("ISER")
    1756                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("ISER")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   33

    1757                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1759                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1760                            .dwattr $C$DW$118, DW_AT_decl_line(0x196)
    1761                            .dwattr $C$DW$118, DW_AT_decl_column(0x12)
    1762                    
    1763                    $C$DW$119       .dwtag  DW_TAG_member
    1764                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$41)
    1765                            .dwattr $C$DW$119, DW_AT_name("RESERVED0")
    1766                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("RESERVED0")
    1767                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1768                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1769                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1770                            .dwattr $C$DW$119, DW_AT_decl_line(0x197)
    1771                            .dwattr $C$DW$119, DW_AT_decl_column(0x12)
    1772                    
    1773                    $C$DW$120       .dwtag  DW_TAG_member
    1774                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$40)
    1775                            .dwattr $C$DW$120, DW_AT_name("ICER")
    1776                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("ICER")
    1777                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1778                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1779                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1780                            .dwattr $C$DW$120, DW_AT_decl_line(0x198)
    1781                            .dwattr $C$DW$120, DW_AT_decl_column(0x12)
    1782                    
    1783                    $C$DW$121       .dwtag  DW_TAG_member
    1784                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$41)
    1785                            .dwattr $C$DW$121, DW_AT_name("RSERVED1")
    1786                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("RSERVED1")
    1787                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1788                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1789                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1790                            .dwattr $C$DW$121, DW_AT_decl_line(0x199)
    1791                            .dwattr $C$DW$121, DW_AT_decl_column(0x12)
    1792                    
    1793                    $C$DW$122       .dwtag  DW_TAG_member
    1794                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$40)
    1795                            .dwattr $C$DW$122, DW_AT_name("ISPR")
    1796                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("ISPR")
    1797                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1798                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1799                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1800                            .dwattr $C$DW$122, DW_AT_decl_line(0x19a)
    1801                            .dwattr $C$DW$122, DW_AT_decl_column(0x12)
    1802                    
    1803                    $C$DW$123       .dwtag  DW_TAG_member
    1804                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$41)
    1805                            .dwattr $C$DW$123, DW_AT_name("RESERVED2")
    1806                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("RESERVED2")
    1807                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1808                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1809                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1810                            .dwattr $C$DW$123, DW_AT_decl_line(0x19b)
    1811                            .dwattr $C$DW$123, DW_AT_decl_column(0x12)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   34

    1812                    
    1813                    $C$DW$124       .dwtag  DW_TAG_member
    1814                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$40)
    1815                            .dwattr $C$DW$124, DW_AT_name("ICPR")
    1816                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("ICPR")
    1817                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    1818                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1819                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1820                            .dwattr $C$DW$124, DW_AT_decl_line(0x19c)
    1821                            .dwattr $C$DW$124, DW_AT_decl_column(0x12)
    1822                    
    1823                    $C$DW$125       .dwtag  DW_TAG_member
    1824                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$41)
    1825                            .dwattr $C$DW$125, DW_AT_name("RESERVED3")
    1826                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("RESERVED3")
    1827                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    1828                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1829                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1830                            .dwattr $C$DW$125, DW_AT_decl_line(0x19d)
    1831                            .dwattr $C$DW$125, DW_AT_decl_column(0x12)
    1832                    
    1833                    $C$DW$126       .dwtag  DW_TAG_member
    1834                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$40)
    1835                            .dwattr $C$DW$126, DW_AT_name("IABR")
    1836                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("IABR")
    1837                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    1838                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1839                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1840                            .dwattr $C$DW$126, DW_AT_decl_line(0x19e)
    1841                            .dwattr $C$DW$126, DW_AT_decl_column(0x12)
    1842                    
    1843                    $C$DW$127       .dwtag  DW_TAG_member
    1844                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$42)
    1845                            .dwattr $C$DW$127, DW_AT_name("RESERVED4")
    1846                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("RESERVED4")
    1847                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    1848                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1849                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1850                            .dwattr $C$DW$127, DW_AT_decl_line(0x19f)
    1851                            .dwattr $C$DW$127, DW_AT_decl_column(0x12)
    1852                    
    1853                    $C$DW$128       .dwtag  DW_TAG_member
    1854                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$43)
    1855                            .dwattr $C$DW$128, DW_AT_name("IP")
    1856                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("IP")
    1857                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    1858                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1859                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1860                            .dwattr $C$DW$128, DW_AT_decl_line(0x1a0)
    1861                            .dwattr $C$DW$128, DW_AT_decl_column(0x12)
    1862                    
    1863                    $C$DW$129       .dwtag  DW_TAG_member
    1864                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$44)
    1865                            .dwattr $C$DW$129, DW_AT_name("RESERVED5")
    1866                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("RESERVED5")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   35

    1867                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    1868                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1869                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1870                            .dwattr $C$DW$129, DW_AT_decl_line(0x1a1)
    1871                            .dwattr $C$DW$129, DW_AT_decl_column(0x12)
    1872                    
    1873                    $C$DW$130       .dwtag  DW_TAG_member
    1874                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$39)
    1875                            .dwattr $C$DW$130, DW_AT_name("STIR")
    1876                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("STIR")
    1877                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    1878                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1879                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1880                            .dwattr $C$DW$130, DW_AT_decl_line(0x1a2)
    1881                            .dwattr $C$DW$130, DW_AT_decl_column(0x12)
    1882                    
    1883                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1884                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x195)
    1885                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    1886                            .dwendtag $C$DW$T$45
    1887                    
    1888                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    1889                            .dwattr $C$DW$T$184, DW_AT_name("NVIC_Type")
    1890                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$45)
    1891                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    1892                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    1893                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x1a3)
    1894                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x04)
    1895                    
    1896                    
    1897                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1898                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x8c)
    1899                    $C$DW$131       .dwtag  DW_TAG_member
    1900                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$46)
    1901                            .dwattr $C$DW$131, DW_AT_name("CPUID")
    1902                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("CPUID")
    1903                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1904                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1905                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1906                            .dwattr $C$DW$131, DW_AT_decl_line(0x1b8)
    1907                            .dwattr $C$DW$131, DW_AT_decl_column(0x12)
    1908                    
    1909                    $C$DW$132       .dwtag  DW_TAG_member
    1910                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$39)
    1911                            .dwattr $C$DW$132, DW_AT_name("ICSR")
    1912                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("ICSR")
    1913                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1914                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1915                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1916                            .dwattr $C$DW$132, DW_AT_decl_line(0x1b9)
    1917                            .dwattr $C$DW$132, DW_AT_decl_column(0x12)
    1918                    
    1919                    $C$DW$133       .dwtag  DW_TAG_member
    1920                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$39)
    1921                            .dwattr $C$DW$133, DW_AT_name("VTOR")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   36

    1922                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("VTOR")
    1923                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1924                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1925                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1926                            .dwattr $C$DW$133, DW_AT_decl_line(0x1ba)
    1927                            .dwattr $C$DW$133, DW_AT_decl_column(0x12)
    1928                    
    1929                    $C$DW$134       .dwtag  DW_TAG_member
    1930                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$39)
    1931                            .dwattr $C$DW$134, DW_AT_name("AIRCR")
    1932                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("AIRCR")
    1933                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1934                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1935                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1936                            .dwattr $C$DW$134, DW_AT_decl_line(0x1bb)
    1937                            .dwattr $C$DW$134, DW_AT_decl_column(0x12)
    1938                    
    1939                    $C$DW$135       .dwtag  DW_TAG_member
    1940                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$39)
    1941                            .dwattr $C$DW$135, DW_AT_name("SCR")
    1942                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("SCR")
    1943                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1944                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1945                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1946                            .dwattr $C$DW$135, DW_AT_decl_line(0x1bc)
    1947                            .dwattr $C$DW$135, DW_AT_decl_column(0x12)
    1948                    
    1949                    $C$DW$136       .dwtag  DW_TAG_member
    1950                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$39)
    1951                            .dwattr $C$DW$136, DW_AT_name("CCR")
    1952                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("CCR")
    1953                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1954                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1955                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1956                            .dwattr $C$DW$136, DW_AT_decl_line(0x1bd)
    1957                            .dwattr $C$DW$136, DW_AT_decl_column(0x12)
    1958                    
    1959                    $C$DW$137       .dwtag  DW_TAG_member
    1960                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$47)
    1961                            .dwattr $C$DW$137, DW_AT_name("SHP")
