TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                              PC v20.2.6.LTS *
       3                    ;* Date/Time created: Mon Oct 31 23:16:54 2022                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../system_msp432p401r.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v20.2.6.LTS Copyright (c) 1996
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Y2S1\SC2107 Lab\Lab1_C_Programming\Debug")
      13                            .global SystemCoreClock
      14 00000000                   .data
      15                            .align  4

     644                    
     645                            .align  4
     646 000002d8 40010450  ||$C$CON4||:    .bits           0x40010450,32
     647                    
     648                            .align  4
     649 000002dc 4220863C  ||$C$CON5||:    .bits           0x4220863c,32
     650                    
     651                            .align  4
     652 000002e0 00000000! ||$C$CON6||:    .bits   SystemCoreClock,32
     653                            .align  4
     654 000002e4 40010404  ||$C$CON7||:    .bits           0x40010404,32
     655                    
     656                            .align  4
     657 000002e8 0016E360  ||$C$CON8||:    .bits           0x16e360,32
     658                    
     659                            .align  4
     660 000002ec 002DC6C0  ||$C$CON9||:    .bits           0x2dc6c0,32
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   13

     661                    
     662                            .align  4
     663 000002f0 005B8D80  ||$C$CON10||:   .bits           0x5b8d80,32
     664                    
     665                            .align  4
     666 000002f4 00B71B00  ||$C$CON11||:   .bits           0xb71b00,32
     667                    
     668                            .align  4
     669 000002f8 016E3600  ||$C$CON12||:   .bits           0x16e3600,32
     670                    
     671                            .align  4
     672 000002fc 02DC6C00  ||$C$CON13||:   .bits           0x2dc6c00,32
     673                    
     674                            .align  4
     675 00000300 422080D8  ||$C$CON14||:   .bits           0x422080d8,32
     676                    
     677                            .align  4
     678 00000304 00201084  ||$C$CON15||:   .bits           0x201084,32
     679                    
     680                            .align  4
     681 00000308 0020106C  ||$C$CON16||:   .bits           0x20106c,32
     682                    
     683                            .align  4
     684 0000030c 00201064  ||$C$CON17||:   .bits           0x201064,32
     685                    
     686                            .align  4
     687 00000310 0020104C  ||$C$CON18||:   .bits           0x20104c,32
     688                    
     689                            .align  4
     690 00000314 42208904  ||$C$CON19||:   .bits           0x42208904,32
     691                    
     692                            .align  4
     693 00000318 E000ED88  ||$C$CON20||:   .bits           0xe000ed88,32
     694                    
     695                            .align  4
     696 0000031c 4000480C  ||$C$CON21||:   .bits           0x4000480c,32
     697                    
     698                            .align  4
     699 00000320 E0043014  ||$C$CON22||:   .bits           0xe0043014,32
     700                    
     701                            .align  4
     702 00000324 40011010  ||$C$CON23||:   .bits           0x40011010,32
     703                    
     704                            .align  4
     705 00000328 40011014  ||$C$CON24||:   .bits           0x40011014,32
     706                    
     707                    
     708                    ;******************************************************************************
     709                    ;* BUILD ATTRIBUTES                                                           *
     710                    ;******************************************************************************
     711                            .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     712                            .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0111111111100000000000000
     713                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     714                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     715                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   14

     716                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     717                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     718                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     719                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
     720                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     721                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     722                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     723                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     724                    
     725                    ;******************************************************************************
     726                    ;* TYPE INFORMATION                                                           *
     727                    ;******************************************************************************
     728                    
     729                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
     730                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x68)
     731                    $C$DW$13        .dwtag  DW_TAG_member
     732                            .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$23)
     733                            .dwattr $C$DW$13, DW_AT_name("KEY")
     734                            .dwattr $C$DW$13, DW_AT_TI_symbol_name("KEY")
     735                            .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736                            .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     737                            .dwattr $C$DW$13, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     738                            .dwattr $C$DW$13, DW_AT_decl_line(0x1d9)
     739                            .dwattr $C$DW$13, DW_AT_decl_column(0x11)
     740                    
     741                    $C$DW$14        .dwtag  DW_TAG_member
     742                            .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$23)
     743                            .dwattr $C$DW$14, DW_AT_name("CTL0")
     744                            .dwattr $C$DW$14, DW_AT_TI_symbol_name("CTL0")
     745                            .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     746                            .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     747                            .dwattr $C$DW$14, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     748                            .dwattr $C$DW$14, DW_AT_decl_line(0x1da)
     749                            .dwattr $C$DW$14, DW_AT_decl_column(0x11)
     750                    
     751                    $C$DW$15        .dwtag  DW_TAG_member
     752                            .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$23)
     753                            .dwattr $C$DW$15, DW_AT_name("CTL1")
     754                            .dwattr $C$DW$15, DW_AT_TI_symbol_name("CTL1")
     755                            .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     756                            .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     757                            .dwattr $C$DW$15, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     758                            .dwattr $C$DW$15, DW_AT_decl_line(0x1db)
     759                            .dwattr $C$DW$15, DW_AT_decl_column(0x11)
     760                    
     761                    $C$DW$16        .dwtag  DW_TAG_member
     762                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$23)
     763                            .dwattr $C$DW$16, DW_AT_name("CTL2")
     764                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("CTL2")
     765                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     766                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     767                            .dwattr $C$DW$16, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     768                            .dwattr $C$DW$16, DW_AT_decl_line(0x1dc)
     769                            .dwattr $C$DW$16, DW_AT_decl_column(0x11)
     770                    
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   15

     771                    $C$DW$17        .dwtag  DW_TAG_member
     772                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$23)
     773                            .dwattr $C$DW$17, DW_AT_name("CTL3")
     774                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("CTL3")
     775                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     776                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     777                            .dwattr $C$DW$17, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     778                            .dwattr $C$DW$17, DW_AT_decl_line(0x1dd)
     779                            .dwattr $C$DW$17, DW_AT_decl_column(0x11)
     780                    
     781                    $C$DW$18        .dwtag  DW_TAG_member
     782                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$24)
     783                            .dwattr $C$DW$18, DW_AT_name("RESERVED0")
     784                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("RESERVED0")
     785                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     786                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     787                            .dwattr $C$DW$18, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     788                            .dwattr $C$DW$18, DW_AT_decl_line(0x1de)
     789                            .dwattr $C$DW$18, DW_AT_decl_column(0x11)
     790                    
     791                    $C$DW$19        .dwtag  DW_TAG_member
     792                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$23)
     793                            .dwattr $C$DW$19, DW_AT_name("CLKEN")
     794                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("CLKEN")
     795                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     796                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     797                            .dwattr $C$DW$19, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     798                            .dwattr $C$DW$19, DW_AT_decl_line(0x1df)
     799                            .dwattr $C$DW$19, DW_AT_decl_column(0x11)
     800                    
     801                    $C$DW$20        .dwtag  DW_TAG_member
     802                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$25)
     803                            .dwattr $C$DW$20, DW_AT_name("STAT")
     804                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("STAT")
     805                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     806                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     807                            .dwattr $C$DW$20, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     808                            .dwattr $C$DW$20, DW_AT_decl_line(0x1e0)
     809                            .dwattr $C$DW$20, DW_AT_decl_column(0x11)
     810                    
     811                    $C$DW$21        .dwtag  DW_TAG_member
     812                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$26)
     813                            .dwattr $C$DW$21, DW_AT_name("RESERVED1")
     814                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("RESERVED1")
     815                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     816                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     817                            .dwattr $C$DW$21, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     818                            .dwattr $C$DW$21, DW_AT_decl_line(0x1e1)
     819                            .dwattr $C$DW$21, DW_AT_decl_column(0x11)
     820                    
     821                    $C$DW$22        .dwtag  DW_TAG_member
     822                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$23)
     823                            .dwattr $C$DW$22, DW_AT_name("IE")
     824                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("IE")
     825                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   16

     826                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     827                            .dwattr $C$DW$22, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     828                            .dwattr $C$DW$22, DW_AT_decl_line(0x1e2)
     829                            .dwattr $C$DW$22, DW_AT_decl_column(0x11)
     830                    
     831                    $C$DW$23        .dwtag  DW_TAG_member
     832                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$22)
     833                            .dwattr $C$DW$23, DW_AT_name("RESERVED2")
     834                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("RESERVED2")
     835                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     836                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     837                            .dwattr $C$DW$23, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     838                            .dwattr $C$DW$23, DW_AT_decl_line(0x1e3)
     839                            .dwattr $C$DW$23, DW_AT_decl_column(0x11)
     840                    
     841                    $C$DW$24        .dwtag  DW_TAG_member
     842                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$25)
     843                            .dwattr $C$DW$24, DW_AT_name("IFG")
     844                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("IFG")
     845                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     846                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     847                            .dwattr $C$DW$24, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     848                            .dwattr $C$DW$24, DW_AT_decl_line(0x1e4)
     849                            .dwattr $C$DW$24, DW_AT_decl_column(0x11)
     850                    
     851                    $C$DW$25        .dwtag  DW_TAG_member
     852                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$22)
     853                            .dwattr $C$DW$25, DW_AT_name("RESERVED3")
     854                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("RESERVED3")
     855                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     856                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     857                            .dwattr $C$DW$25, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     858                            .dwattr $C$DW$25, DW_AT_decl_line(0x1e5)
     859                            .dwattr $C$DW$25, DW_AT_decl_column(0x11)
     860                    
     861                    $C$DW$26        .dwtag  DW_TAG_member
     862                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$23)
     863                            .dwattr $C$DW$26, DW_AT_name("CLRIFG")
     864                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("CLRIFG")
     865                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     866                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     867                            .dwattr $C$DW$26, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     868                            .dwattr $C$DW$26, DW_AT_decl_line(0x1e6)
     869                            .dwattr $C$DW$26, DW_AT_decl_column(0x11)
     870                    
     871                    $C$DW$27        .dwtag  DW_TAG_member
     872                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$22)
     873                            .dwattr $C$DW$27, DW_AT_name("RESERVED4")
     874                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("RESERVED4")
     875                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     876                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     877                            .dwattr $C$DW$27, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     878                            .dwattr $C$DW$27, DW_AT_decl_line(0x1e7)
     879                            .dwattr $C$DW$27, DW_AT_decl_column(0x11)
     880                    
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   17

     881                    $C$DW$28        .dwtag  DW_TAG_member
     882                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$23)
     883                            .dwattr $C$DW$28, DW_AT_name("SETIFG")
     884                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("SETIFG")
     885                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
     886                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     887                            .dwattr $C$DW$28, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     888                            .dwattr $C$DW$28, DW_AT_decl_line(0x1e8)
     889                            .dwattr $C$DW$28, DW_AT_decl_column(0x11)
     890                    
     891                    $C$DW$29        .dwtag  DW_TAG_member
     892                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$22)
     893                            .dwattr $C$DW$29, DW_AT_name("RESERVED5")
     894                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("RESERVED5")
     895                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     896                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     897                            .dwattr $C$DW$29, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     898                            .dwattr $C$DW$29, DW_AT_decl_line(0x1e9)
     899                            .dwattr $C$DW$29, DW_AT_decl_column(0x11)
     900                    
     901                    $C$DW$30        .dwtag  DW_TAG_member
     902                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$23)
     903                            .dwattr $C$DW$30, DW_AT_name("DCOERCAL0")
     904                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("DCOERCAL0")
     905                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     906                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     907                            .dwattr $C$DW$30, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     908                            .dwattr $C$DW$30, DW_AT_decl_line(0x1ea)
     909                            .dwattr $C$DW$30, DW_AT_decl_column(0x11)
     910                    
     911                    $C$DW$31        .dwtag  DW_TAG_member
     912                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$23)
     913                            .dwattr $C$DW$31, DW_AT_name("DCOERCAL1")
     914                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("DCOERCAL1")
     915                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
     916                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     917                            .dwattr $C$DW$31, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     918                            .dwattr $C$DW$31, DW_AT_decl_line(0x1eb)
     919                            .dwattr $C$DW$31, DW_AT_decl_column(0x11)
     920                    
     921                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     922                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x1d8)
     923                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
     924                            .dwendtag $C$DW$T$27
     925                    
     926                    $C$DW$T$179     .dwtag  DW_TAG_typedef
     927                            .dwattr $C$DW$T$179, DW_AT_name("CS_Type")
     928                            .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$27)
     929                            .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
     930                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     931                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x1ec)
     932                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x03)
     933                    
     934                    
     935                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   18

     936                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x14c)
     937                    $C$DW$32        .dwtag  DW_TAG_member
     938                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$25)
     939                            .dwattr $C$DW$32, DW_AT_name("TLV_CHECKSUM")
     940                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("TLV_CHECKSUM")
     941                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     943                            .dwattr $C$DW$32, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     944                            .dwattr $C$DW$32, DW_AT_decl_line(0x4c4)
     945                            .dwattr $C$DW$32, DW_AT_decl_column(0x11)
     946                    
     947                    $C$DW$33        .dwtag  DW_TAG_member
     948                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$25)
     949                            .dwattr $C$DW$33, DW_AT_name("DEVICE_INFO_TAG")
     950                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("DEVICE_INFO_TAG")
     951                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     952                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     953                            .dwattr $C$DW$33, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     954                            .dwattr $C$DW$33, DW_AT_decl_line(0x4c5)
     955                            .dwattr $C$DW$33, DW_AT_decl_column(0x11)
     956                    
     957                    $C$DW$34        .dwtag  DW_TAG_member
     958                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$25)
     959                            .dwattr $C$DW$34, DW_AT_name("DEVICE_INFO_LEN")
     960                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("DEVICE_INFO_LEN")
     961                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     962                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     963                            .dwattr $C$DW$34, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     964                            .dwattr $C$DW$34, DW_AT_decl_line(0x4c6)
     965                            .dwattr $C$DW$34, DW_AT_decl_column(0x11)
     966                    
     967                    $C$DW$35        .dwtag  DW_TAG_member
     968                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$25)
     969                            .dwattr $C$DW$35, DW_AT_name("DEVICE_ID")
     970                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("DEVICE_ID")
     971                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     972                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     973                            .dwattr $C$DW$35, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     974                            .dwattr $C$DW$35, DW_AT_decl_line(0x4c7)
     975                            .dwattr $C$DW$35, DW_AT_decl_column(0x11)
     976                    
     977                    $C$DW$36        .dwtag  DW_TAG_member
     978                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$25)
     979                            .dwattr $C$DW$36, DW_AT_name("HWREV")
     980                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("HWREV")
     981                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     982                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     983                            .dwattr $C$DW$36, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     984                            .dwattr $C$DW$36, DW_AT_decl_line(0x4c8)
     985                            .dwattr $C$DW$36, DW_AT_decl_column(0x11)
     986                    
     987                    $C$DW$37        .dwtag  DW_TAG_member
     988                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$25)
     989                            .dwattr $C$DW$37, DW_AT_name("BCREV")
     990                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("BCREV")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   19

     991                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     992                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     993                            .dwattr $C$DW$37, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     994                            .dwattr $C$DW$37, DW_AT_decl_line(0x4c9)
     995                            .dwattr $C$DW$37, DW_AT_decl_column(0x11)
     996                    
     997                    $C$DW$38        .dwtag  DW_TAG_member
     998                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$25)
     999                            .dwattr $C$DW$38, DW_AT_name("ROM_DRVLIB_REV")
    1000                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("ROM_DRVLIB_REV")
    1001                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1002                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
    1003                            .dwattr $C$DW$38, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1004                            .dwattr $C$DW$38, DW_AT_decl_line(0x4ca)
    1005                            .dwattr $C$DW$38, DW_AT_decl_column(0x11)
    1006                    
    1007                    $C$DW$39        .dwtag  DW_TAG_member
    1008                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$25)
    1009                            .dwattr $C$DW$39, DW_AT_name("DIE_REC_TAG")
    1010                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("DIE_REC_TAG")
    1011                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1012                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
    1013                            .dwattr $C$DW$39, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1014                            .dwattr $C$DW$39, DW_AT_decl_line(0x4cb)
    1015                            .dwattr $C$DW$39, DW_AT_decl_column(0x11)
    1016                    
    1017                    $C$DW$40        .dwtag  DW_TAG_member
    1018                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$25)
    1019                            .dwattr $C$DW$40, DW_AT_name("DIE_REC_LEN")
    1020                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("DIE_REC_LEN")
    1021                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1022                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
    1023                            .dwattr $C$DW$40, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1024                            .dwattr $C$DW$40, DW_AT_decl_line(0x4cc)
    1025                            .dwattr $C$DW$40, DW_AT_decl_column(0x11)
    1026                    
    1027                    $C$DW$41        .dwtag  DW_TAG_member
    1028                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$25)
    1029                            .dwattr $C$DW$41, DW_AT_name("DIE_XPOS")
    1030                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("DIE_XPOS")
    1031                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1032                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1033                            .dwattr $C$DW$41, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1034                            .dwattr $C$DW$41, DW_AT_decl_line(0x4cd)
    1035                            .dwattr $C$DW$41, DW_AT_decl_column(0x11)
    1036                    
    1037                    $C$DW$42        .dwtag  DW_TAG_member
    1038                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$25)
    1039                            .dwattr $C$DW$42, DW_AT_name("DIE_YPOS")
    1040                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("DIE_YPOS")
    1041                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1042                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1043                            .dwattr $C$DW$42, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1044                            .dwattr $C$DW$42, DW_AT_decl_line(0x4ce)
    1045                            .dwattr $C$DW$42, DW_AT_decl_column(0x11)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   20

    1046                    
    1047                    $C$DW$43        .dwtag  DW_TAG_member
    1048                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$25)
    1049                            .dwattr $C$DW$43, DW_AT_name("WAFER_ID")
    1050                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("WAFER_ID")
    1051                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1052                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1053                            .dwattr $C$DW$43, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1054                            .dwattr $C$DW$43, DW_AT_decl_line(0x4cf)
    1055                            .dwattr $C$DW$43, DW_AT_decl_column(0x11)
    1056                    
    1057                    $C$DW$44        .dwtag  DW_TAG_member
    1058                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$25)
    1059                            .dwattr $C$DW$44, DW_AT_name("LOT_ID")
    1060                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("LOT_ID")
    1061                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1062                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1063                            .dwattr $C$DW$44, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1064                            .dwattr $C$DW$44, DW_AT_decl_line(0x4d0)
    1065                            .dwattr $C$DW$44, DW_AT_decl_column(0x11)
    1066                    
    1067                    $C$DW$45        .dwtag  DW_TAG_member
    1068                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$25)
    1069                            .dwattr $C$DW$45, DW_AT_name("RESERVED0")
    1070                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("RESERVED0")
    1071                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1072                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1073                            .dwattr $C$DW$45, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1074                            .dwattr $C$DW$45, DW_AT_decl_line(0x4d1)
    1075                            .dwattr $C$DW$45, DW_AT_decl_column(0x11)
    1076                    
    1077                    $C$DW$46        .dwtag  DW_TAG_member
    1078                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$25)
    1079                            .dwattr $C$DW$46, DW_AT_name("RESERVED1")
    1080                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("RESERVED1")
    1081                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1082                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1083                            .dwattr $C$DW$46, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1084                            .dwattr $C$DW$46, DW_AT_decl_line(0x4d2)
    1085                            .dwattr $C$DW$46, DW_AT_decl_column(0x11)
    1086                    
    1087                    $C$DW$47        .dwtag  DW_TAG_member
    1088                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$25)
    1089                            .dwattr $C$DW$47, DW_AT_name("RESERVED2")
    1090                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("RESERVED2")
    1091                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1092                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1093                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1094                            .dwattr $C$DW$47, DW_AT_decl_line(0x4d3)
    1095                            .dwattr $C$DW$47, DW_AT_decl_column(0x11)
    1096                    
    1097                    $C$DW$48        .dwtag  DW_TAG_member
    1098                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$25)
    1099                            .dwattr $C$DW$48, DW_AT_name("TEST_RESULTS")
    1100                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("TEST_RESULTS")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   21

    1101                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1102                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1103                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1104                            .dwattr $C$DW$48, DW_AT_decl_line(0x4d4)
    1105                            .dwattr $C$DW$48, DW_AT_decl_column(0x11)
    1106                    
    1107                    $C$DW$49        .dwtag  DW_TAG_member
    1108                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$25)
    1109                            .dwattr $C$DW$49, DW_AT_name("CS_CAL_TAG")
    1110                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("CS_CAL_TAG")
    1111                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1112                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1113                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1114                            .dwattr $C$DW$49, DW_AT_decl_line(0x4d5)
    1115                            .dwattr $C$DW$49, DW_AT_decl_column(0x11)
    1116                    
    1117                    $C$DW$50        .dwtag  DW_TAG_member
    1118                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$25)
    1119                            .dwattr $C$DW$50, DW_AT_name("CS_CAL_LEN")
    1120                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("CS_CAL_LEN")
    1121                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1122                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1123                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1124                            .dwattr $C$DW$50, DW_AT_decl_line(0x4d6)
    1125                            .dwattr $C$DW$50, DW_AT_decl_column(0x11)
    1126                    
    1127                    $C$DW$51        .dwtag  DW_TAG_member
    1128                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$25)
    1129                            .dwattr $C$DW$51, DW_AT_name("DCOIR_FCAL_RSEL04")
    1130                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("DCOIR_FCAL_RSEL04")
    1131                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1132                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1133                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1134                            .dwattr $C$DW$51, DW_AT_decl_line(0x4d7)
    1135                            .dwattr $C$DW$51, DW_AT_decl_column(0x11)
    1136                    
    1137                    $C$DW$52        .dwtag  DW_TAG_member
    1138                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$25)
    1139                            .dwattr $C$DW$52, DW_AT_name("DCOIR_FCAL_RSEL5")
    1140                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("DCOIR_FCAL_RSEL5")
    1141                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1142                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1143                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1144                            .dwattr $C$DW$52, DW_AT_decl_line(0x4d8)
    1145                            .dwattr $C$DW$52, DW_AT_decl_column(0x11)
    1146                    
    1147                    $C$DW$53        .dwtag  DW_TAG_member
    1148                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$25)
    1149                            .dwattr $C$DW$53, DW_AT_name("RESERVED3")
    1150                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("RESERVED3")
    1151                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1152                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1153                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1154                            .dwattr $C$DW$53, DW_AT_decl_line(0x4d9)
    1155                            .dwattr $C$DW$53, DW_AT_decl_column(0x11)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   22

    1156                    
    1157                    $C$DW$54        .dwtag  DW_TAG_member
    1158                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$25)
    1159                            .dwattr $C$DW$54, DW_AT_name("RESERVED4")
    1160                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("RESERVED4")
    1161                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1162                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1163                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1164                            .dwattr $C$DW$54, DW_AT_decl_line(0x4da)
    1165                            .dwattr $C$DW$54, DW_AT_decl_column(0x11)
    1166                    
    1167                    $C$DW$55        .dwtag  DW_TAG_member
    1168                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$25)
    1169                            .dwattr $C$DW$55, DW_AT_name("RESERVED5")
    1170                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("RESERVED5")
    1171                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1172                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1173                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1174                            .dwattr $C$DW$55, DW_AT_decl_line(0x4db)
    1175                            .dwattr $C$DW$55, DW_AT_decl_column(0x11)
    1176                    
    1177                    $C$DW$56        .dwtag  DW_TAG_member
    1178                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$25)
    1179                            .dwattr $C$DW$56, DW_AT_name("RESERVED6")
    1180                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("RESERVED6")
    1181                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1182                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1183                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1184                            .dwattr $C$DW$56, DW_AT_decl_line(0x4dc)
    1185                            .dwattr $C$DW$56, DW_AT_decl_column(0x11)
    1186                    
    1187                    $C$DW$57        .dwtag  DW_TAG_member
    1188                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$25)
    1189                            .dwattr $C$DW$57, DW_AT_name("DCOIR_CONSTK_RSEL04")
    1190                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("DCOIR_CONSTK_RSEL04")
    1191                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1192                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1193                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1194                            .dwattr $C$DW$57, DW_AT_decl_line(0x4dd)
    1195                            .dwattr $C$DW$57, DW_AT_decl_column(0x11)
    1196                    
    1197                    $C$DW$58        .dwtag  DW_TAG_member
    1198                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$25)
    1199                            .dwattr $C$DW$58, DW_AT_name("DCOIR_CONSTK_RSEL5")
    1200                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("DCOIR_CONSTK_RSEL5")
    1201                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1202                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1203                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1204                            .dwattr $C$DW$58, DW_AT_decl_line(0x4de)
    1205                            .dwattr $C$DW$58, DW_AT_decl_column(0x11)
    1206                    
    1207                    $C$DW$59        .dwtag  DW_TAG_member
    1208                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$25)
    1209                            .dwattr $C$DW$59, DW_AT_name("DCOER_FCAL_RSEL04")
    1210                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("DCOER_FCAL_RSEL04")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   23

    1211                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1212                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1213                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1214                            .dwattr $C$DW$59, DW_AT_decl_line(0x4df)
    1215                            .dwattr $C$DW$59, DW_AT_decl_column(0x11)
    1216                    
    1217                    $C$DW$60        .dwtag  DW_TAG_member
    1218                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$25)
    1219                            .dwattr $C$DW$60, DW_AT_name("DCOER_FCAL_RSEL5")
    1220                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("DCOER_FCAL_RSEL5")
    1221                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    1222                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1223                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1224                            .dwattr $C$DW$60, DW_AT_decl_line(0x4e0)
    1225                            .dwattr $C$DW$60, DW_AT_decl_column(0x11)
    1226                    
    1227                    $C$DW$61        .dwtag  DW_TAG_member
    1228                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$25)
    1229                            .dwattr $C$DW$61, DW_AT_name("RESERVED7")
    1230                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("RESERVED7")
    1231                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1232                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1233                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1234                            .dwattr $C$DW$61, DW_AT_decl_line(0x4e1)
    1235                            .dwattr $C$DW$61, DW_AT_decl_column(0x11)
    1236                    
    1237                    $C$DW$62        .dwtag  DW_TAG_member
    1238                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$25)
    1239                            .dwattr $C$DW$62, DW_AT_name("RESERVED8")
    1240                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("RESERVED8")
    1241                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1242                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1243                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1244                            .dwattr $C$DW$62, DW_AT_decl_line(0x4e2)
    1245                            .dwattr $C$DW$62, DW_AT_decl_column(0x11)
    1246                    
    1247                    $C$DW$63        .dwtag  DW_TAG_member
    1248                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$25)
    1249                            .dwattr $C$DW$63, DW_AT_name("RESERVED9")
    1250                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("RESERVED9")
    1251                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1252                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1253                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1254                            .dwattr $C$DW$63, DW_AT_decl_line(0x4e3)
    1255                            .dwattr $C$DW$63, DW_AT_decl_column(0x11)
    1256                    
    1257                    $C$DW$64        .dwtag  DW_TAG_member
    1258                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$25)
    1259                            .dwattr $C$DW$64, DW_AT_name("RESERVED10")
    1260                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("RESERVED10")
    1261                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1262                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1263                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1264                            .dwattr $C$DW$64, DW_AT_decl_line(0x4e4)
    1265                            .dwattr $C$DW$64, DW_AT_decl_column(0x11)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   24

    1266                    
    1267                    $C$DW$65        .dwtag  DW_TAG_member
    1268                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$25)
    1269                            .dwattr $C$DW$65, DW_AT_name("DCOER_CONSTK_RSEL04")
    1270                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("DCOER_CONSTK_RSEL04")
    1271                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    1272                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1273                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1274                            .dwattr $C$DW$65, DW_AT_decl_line(0x4e5)
    1275                            .dwattr $C$DW$65, DW_AT_decl_column(0x11)
    1276                    
    1277                    $C$DW$66        .dwtag  DW_TAG_member
    1278                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$25)
    1279                            .dwattr $C$DW$66, DW_AT_name("DCOER_CONSTK_RSEL5")
    1280                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("DCOER_CONSTK_RSEL5")
    1281                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1282                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1283                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1284                            .dwattr $C$DW$66, DW_AT_decl_line(0x4e6)
    1285                            .dwattr $C$DW$66, DW_AT_decl_column(0x11)
    1286                    
    1287                    $C$DW$67        .dwtag  DW_TAG_member
    1288                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$25)
    1289                            .dwattr $C$DW$67, DW_AT_name("ADC14_CAL_TAG")
    1290                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("ADC14_CAL_TAG")
    1291                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    1292                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1293                            .dwattr $C$DW$67, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1294                            .dwattr $C$DW$67, DW_AT_decl_line(0x4e7)
    1295                            .dwattr $C$DW$67, DW_AT_decl_column(0x11)
    1296                    
    1297                    $C$DW$68        .dwtag  DW_TAG_member
    1298                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$25)
    1299                            .dwattr $C$DW$68, DW_AT_name("ADC14_CAL_LEN")
    1300                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("ADC14_CAL_LEN")
    1301                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    1302                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1303                            .dwattr $C$DW$68, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1304                            .dwattr $C$DW$68, DW_AT_decl_line(0x4e8)
    1305                            .dwattr $C$DW$68, DW_AT_decl_column(0x11)
    1306                    
    1307                    $C$DW$69        .dwtag  DW_TAG_member
    1308                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$25)
    1309                            .dwattr $C$DW$69, DW_AT_name("ADC_GAIN_FACTOR")
    1310                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("ADC_GAIN_FACTOR")
    1311                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    1312                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1313                            .dwattr $C$DW$69, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1314                            .dwattr $C$DW$69, DW_AT_decl_line(0x4e9)
    1315                            .dwattr $C$DW$69, DW_AT_decl_column(0x11)
    1316                    
    1317                    $C$DW$70        .dwtag  DW_TAG_member
    1318                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$25)
    1319                            .dwattr $C$DW$70, DW_AT_name("ADC_OFFSET")
    1320                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("ADC_OFFSET")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   25

    1321                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    1322                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1323                            .dwattr $C$DW$70, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1324                            .dwattr $C$DW$70, DW_AT_decl_line(0x4ea)
    1325                            .dwattr $C$DW$70, DW_AT_decl_column(0x11)
    1326                    
    1327                    $C$DW$71        .dwtag  DW_TAG_member
    1328                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$25)
    1329                            .dwattr $C$DW$71, DW_AT_name("RESERVED11")
    1330                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("RESERVED11")
    1331                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    1332                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1333                            .dwattr $C$DW$71, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1334                            .dwattr $C$DW$71, DW_AT_decl_line(0x4eb)
    1335                            .dwattr $C$DW$71, DW_AT_decl_column(0x11)
    1336                    
    1337                    $C$DW$72        .dwtag  DW_TAG_member
    1338                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$25)
    1339                            .dwattr $C$DW$72, DW_AT_name("RESERVED12")
    1340                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("RESERVED12")
    1341                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1342                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1343                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1344                            .dwattr $C$DW$72, DW_AT_decl_line(0x4ec)
    1345                            .dwattr $C$DW$72, DW_AT_decl_column(0x11)
    1346                    
    1347                    $C$DW$73        .dwtag  DW_TAG_member
    1348                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$25)
    1349                            .dwattr $C$DW$73, DW_AT_name("RESERVED13")
    1350                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("RESERVED13")
    1351                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    1352                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1353                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1354                            .dwattr $C$DW$73, DW_AT_decl_line(0x4ed)
    1355                            .dwattr $C$DW$73, DW_AT_decl_column(0x11)
    1356                    
    1357                    $C$DW$74        .dwtag  DW_TAG_member
    1358                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$25)
    1359                            .dwattr $C$DW$74, DW_AT_name("RESERVED14")
    1360                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("RESERVED14")
    1361                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    1362                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1363                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1364                            .dwattr $C$DW$74, DW_AT_decl_line(0x4ee)
    1365                            .dwattr $C$DW$74, DW_AT_decl_column(0x11)
    1366                    
    1367                    $C$DW$75        .dwtag  DW_TAG_member
    1368                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$25)
    1369                            .dwattr $C$DW$75, DW_AT_name("RESERVED15")
    1370                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("RESERVED15")
    1371                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    1372                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1373                            .dwattr $C$DW$75, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1374                            .dwattr $C$DW$75, DW_AT_decl_line(0x4ef)
    1375                            .dwattr $C$DW$75, DW_AT_decl_column(0x11)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   26

    1376                    
    1377                    $C$DW$76        .dwtag  DW_TAG_member
    1378                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$25)
    1379                            .dwattr $C$DW$76, DW_AT_name("RESERVED16")
    1380                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("RESERVED16")
    1381                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1382                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1383                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1384                            .dwattr $C$DW$76, DW_AT_decl_line(0x4f0)
    1385                            .dwattr $C$DW$76, DW_AT_decl_column(0x11)
    1386                    
    1387                    $C$DW$77        .dwtag  DW_TAG_member
    1388                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$25)
    1389                            .dwattr $C$DW$77, DW_AT_name("RESERVED17")
    1390                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("RESERVED17")
    1391                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    1392                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1393                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1394                            .dwattr $C$DW$77, DW_AT_decl_line(0x4f1)
    1395                            .dwattr $C$DW$77, DW_AT_decl_column(0x11)
    1396                    
    1397                    $C$DW$78        .dwtag  DW_TAG_member
    1398                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$25)
    1399                            .dwattr $C$DW$78, DW_AT_name("RESERVED18")
    1400                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("RESERVED18")
    1401                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    1402                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1403                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1404                            .dwattr $C$DW$78, DW_AT_decl_line(0x4f2)
    1405                            .dwattr $C$DW$78, DW_AT_decl_column(0x11)
    1406                    
    1407                    $C$DW$79        .dwtag  DW_TAG_member
    1408                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$25)
    1409                            .dwattr $C$DW$79, DW_AT_name("RESERVED19")
    1410                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("RESERVED19")
    1411                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    1412                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1413                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1414                            .dwattr $C$DW$79, DW_AT_decl_line(0x4f3)
    1415                            .dwattr $C$DW$79, DW_AT_decl_column(0x11)
    1416                    
    1417                    $C$DW$80        .dwtag  DW_TAG_member
    1418                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$25)
    1419                            .dwattr $C$DW$80, DW_AT_name("RESERVED20")
    1420                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("RESERVED20")
    1421                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    1422                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1423                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1424                            .dwattr $C$DW$80, DW_AT_decl_line(0x4f4)
    1425                            .dwattr $C$DW$80, DW_AT_decl_column(0x11)
    1426                    
    1427                    $C$DW$81        .dwtag  DW_TAG_member
    1428                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$25)
    1429                            .dwattr $C$DW$81, DW_AT_name("RESERVED21")
    1430                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("RESERVED21")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   27

    1431                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    1432                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1433                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1434                            .dwattr $C$DW$81, DW_AT_decl_line(0x4f5)
    1435                            .dwattr $C$DW$81, DW_AT_decl_column(0x11)
    1436                    
    1437                    $C$DW$82        .dwtag  DW_TAG_member
    1438                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$25)
    1439                            .dwattr $C$DW$82, DW_AT_name("RESERVED22")
    1440                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("RESERVED22")
    1441                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    1442                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1443                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1444                            .dwattr $C$DW$82, DW_AT_decl_line(0x4f6)
    1445                            .dwattr $C$DW$82, DW_AT_decl_column(0x11)
    1446                    
    1447                    $C$DW$83        .dwtag  DW_TAG_member
    1448                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$25)
    1449                            .dwattr $C$DW$83, DW_AT_name("RESERVED23")
    1450                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("RESERVED23")
    1451                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    1452                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1453                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1454                            .dwattr $C$DW$83, DW_AT_decl_line(0x4f7)
    1455                            .dwattr $C$DW$83, DW_AT_decl_column(0x11)
    1456                    
    1457                    $C$DW$84        .dwtag  DW_TAG_member
    1458                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$25)
    1459                            .dwattr $C$DW$84, DW_AT_name("RESERVED24")
    1460                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("RESERVED24")
    1461                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    1462                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1463                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1464                            .dwattr $C$DW$84, DW_AT_decl_line(0x4f8)
    1465                            .dwattr $C$DW$84, DW_AT_decl_column(0x11)
    1466                    
    1467                    $C$DW$85        .dwtag  DW_TAG_member
    1468                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$25)
    1469                            .dwattr $C$DW$85, DW_AT_name("RESERVED25")
    1470                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("RESERVED25")
    1471                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    1472                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1473                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1474                            .dwattr $C$DW$85, DW_AT_decl_line(0x4f9)
    1475                            .dwattr $C$DW$85, DW_AT_decl_column(0x11)
    1476                    
    1477                    $C$DW$86        .dwtag  DW_TAG_member
    1478                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$25)
    1479                            .dwattr $C$DW$86, DW_AT_name("RESERVED26")
    1480                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("RESERVED26")
    1481                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    1482                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1483                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1484                            .dwattr $C$DW$86, DW_AT_decl_line(0x4fa)
    1485                            .dwattr $C$DW$86, DW_AT_decl_column(0x11)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   28

    1486                    
    1487                    $C$DW$87        .dwtag  DW_TAG_member
    1488                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$25)
    1489                            .dwattr $C$DW$87, DW_AT_name("ADC14_REF1P2V_TS30C")
    1490                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("ADC14_REF1P2V_TS30C")
    1491                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    1492                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1493                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1494                            .dwattr $C$DW$87, DW_AT_decl_line(0x4fb)
    1495                            .dwattr $C$DW$87, DW_AT_decl_column(0x11)
    1496                    
    1497                    $C$DW$88        .dwtag  DW_TAG_member
    1498                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$25)
    1499                            .dwattr $C$DW$88, DW_AT_name("ADC14_REF1P2V_TS85C")
    1500                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("ADC14_REF1P2V_TS85C")
    1501                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    1502                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1503                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1504                            .dwattr $C$DW$88, DW_AT_decl_line(0x4fc)
    1505                            .dwattr $C$DW$88, DW_AT_decl_column(0x11)
    1506                    
    1507                    $C$DW$89        .dwtag  DW_TAG_member
    1508                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$25)
    1509                            .dwattr $C$DW$89, DW_AT_name("ADC14_REF1P45V_TS30C")
    1510                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("ADC14_REF1P45V_TS30C")
    1511                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    1512                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1513                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1514                            .dwattr $C$DW$89, DW_AT_decl_line(0x4fd)
    1515                            .dwattr $C$DW$89, DW_AT_decl_column(0x11)
    1516                    
    1517                    $C$DW$90        .dwtag  DW_TAG_member
    1518                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$25)
    1519                            .dwattr $C$DW$90, DW_AT_name("ADC14_REF1P45V_TS85C")
    1520                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("ADC14_REF1P45V_TS85C")
    1521                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    1522                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1523                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1524                            .dwattr $C$DW$90, DW_AT_decl_line(0x4fe)
    1525                            .dwattr $C$DW$90, DW_AT_decl_column(0x11)
    1526                    
    1527                    $C$DW$91        .dwtag  DW_TAG_member
    1528                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$25)
    1529                            .dwattr $C$DW$91, DW_AT_name("ADC14_REF2P5V_TS30C")
    1530                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("ADC14_REF2P5V_TS30C")
    1531                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    1532                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1533                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1534                            .dwattr $C$DW$91, DW_AT_decl_line(0x4ff)
    1535                            .dwattr $C$DW$91, DW_AT_decl_column(0x11)
    1536                    
    1537                    $C$DW$92        .dwtag  DW_TAG_member
    1538                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$25)
    1539                            .dwattr $C$DW$92, DW_AT_name("ADC14_REF2P5V_TS85C")
    1540                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("ADC14_REF2P5V_TS85C")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   29

    1541                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    1542                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1543                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1544                            .dwattr $C$DW$92, DW_AT_decl_line(0x500)
    1545                            .dwattr $C$DW$92, DW_AT_decl_column(0x11)
    1546                    
    1547                    $C$DW$93        .dwtag  DW_TAG_member
    1548                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$25)
    1549                            .dwattr $C$DW$93, DW_AT_name("REF_CAL_TAG")
    1550                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("REF_CAL_TAG")
    1551                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    1552                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1553                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1554                            .dwattr $C$DW$93, DW_AT_decl_line(0x501)
    1555                            .dwattr $C$DW$93, DW_AT_decl_column(0x11)
    1556                    
    1557                    $C$DW$94        .dwtag  DW_TAG_member
    1558                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$25)
    1559                            .dwattr $C$DW$94, DW_AT_name("REF_CAL_LEN")
    1560                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("REF_CAL_LEN")
    1561                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    1562                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1563                            .dwattr $C$DW$94, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1564                            .dwattr $C$DW$94, DW_AT_decl_line(0x502)
    1565                            .dwattr $C$DW$94, DW_AT_decl_column(0x11)
    1566                    
    1567                    $C$DW$95        .dwtag  DW_TAG_member
    1568                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$25)
    1569                            .dwattr $C$DW$95, DW_AT_name("REF_1P2V")
    1570                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("REF_1P2V")
    1571                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    1572                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1573                            .dwattr $C$DW$95, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1574                            .dwattr $C$DW$95, DW_AT_decl_line(0x503)
    1575                            .dwattr $C$DW$95, DW_AT_decl_column(0x11)
    1576                    
    1577                    $C$DW$96        .dwtag  DW_TAG_member
    1578                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$25)
    1579                            .dwattr $C$DW$96, DW_AT_name("REF_1P45V")
    1580                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("REF_1P45V")
    1581                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1582                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1583                            .dwattr $C$DW$96, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1584                            .dwattr $C$DW$96, DW_AT_decl_line(0x504)
    1585                            .dwattr $C$DW$96, DW_AT_decl_column(0x11)
    1586                    
    1587                    $C$DW$97        .dwtag  DW_TAG_member
    1588                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$25)
    1589                            .dwattr $C$DW$97, DW_AT_name("REF_2P5V")
    1590                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("REF_2P5V")
    1591                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    1592                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1593                            .dwattr $C$DW$97, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1594                            .dwattr $C$DW$97, DW_AT_decl_line(0x505)
    1595                            .dwattr $C$DW$97, DW_AT_decl_column(0x11)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   30

    1596                    
    1597                    $C$DW$98        .dwtag  DW_TAG_member
    1598                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$25)
    1599                            .dwattr $C$DW$98, DW_AT_name("FLASH_INFO_TAG")
    1600                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("FLASH_INFO_TAG")
    1601                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    1602                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1603                            .dwattr $C$DW$98, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1604                            .dwattr $C$DW$98, DW_AT_decl_line(0x506)
    1605                            .dwattr $C$DW$98, DW_AT_decl_column(0x11)
    1606                    
    1607                    $C$DW$99        .dwtag  DW_TAG_member
    1608                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$25)
    1609                            .dwattr $C$DW$99, DW_AT_name("FLASH_INFO_LEN")
    1610                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("FLASH_INFO_LEN")
    1611                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    1612                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1613                            .dwattr $C$DW$99, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1614                            .dwattr $C$DW$99, DW_AT_decl_line(0x507)
    1615                            .dwattr $C$DW$99, DW_AT_decl_column(0x11)
    1616                    
    1617                    $C$DW$100       .dwtag  DW_TAG_member
    1618                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$25)
    1619                            .dwattr $C$DW$100, DW_AT_name("FLASH_MAX_PROG_PULSES")
    1620                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("FLASH_MAX_PROG_PULSES")
    1621                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    1622                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1623                            .dwattr $C$DW$100, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1624                            .dwattr $C$DW$100, DW_AT_decl_line(0x508)
    1625                            .dwattr $C$DW$100, DW_AT_decl_column(0x11)
    1626                    
    1627                    $C$DW$101       .dwtag  DW_TAG_member
    1628                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$25)
    1629                            .dwattr $C$DW$101, DW_AT_name("FLASH_MAX_ERASE_PULSES")
    1630                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("FLASH_MAX_ERASE_PULSES")
    1631                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    1632                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1633                            .dwattr $C$DW$101, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1634                            .dwattr $C$DW$101, DW_AT_decl_line(0x509)
    1635                            .dwattr $C$DW$101, DW_AT_decl_column(0x11)
    1636                    
    1637                    $C$DW$102       .dwtag  DW_TAG_member
    1638                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$25)
    1639                            .dwattr $C$DW$102, DW_AT_name("RANDOM_NUM_TAG")
    1640                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("RANDOM_NUM_TAG")
    1641                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    1642                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1643                            .dwattr $C$DW$102, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1644                            .dwattr $C$DW$102, DW_AT_decl_line(0x50a)
    1645                            .dwattr $C$DW$102, DW_AT_decl_column(0x11)
    1646                    
    1647                    $C$DW$103       .dwtag  DW_TAG_member
    1648                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$25)
    1649                            .dwattr $C$DW$103, DW_AT_name("RANDOM_NUM_LEN")
    1650                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("RANDOM_NUM_LEN")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   31

    1651                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    1652                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1653                            .dwattr $C$DW$103, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1654                            .dwattr $C$DW$103, DW_AT_decl_line(0x50b)
    1655                            .dwattr $C$DW$103, DW_AT_decl_column(0x11)
    1656                    
    1657                    $C$DW$104       .dwtag  DW_TAG_member
    1658                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$25)
    1659                            .dwattr $C$DW$104, DW_AT_name("RANDOM_NUM_1")
    1660                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("RANDOM_NUM_1")
    1661                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1662                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1663                            .dwattr $C$DW$104, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1664                            .dwattr $C$DW$104, DW_AT_decl_line(0x50c)
    1665                            .dwattr $C$DW$104, DW_AT_decl_column(0x11)
    1666                    
    1667                    $C$DW$105       .dwtag  DW_TAG_member
    1668                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$25)
    1669                            .dwattr $C$DW$105, DW_AT_name("RANDOM_NUM_2")
    1670                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("RANDOM_NUM_2")
    1671                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    1672                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1673                            .dwattr $C$DW$105, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1674                            .dwattr $C$DW$105, DW_AT_decl_line(0x50d)
    1675                            .dwattr $C$DW$105, DW_AT_decl_column(0x11)
    1676                    
    1677                    $C$DW$106       .dwtag  DW_TAG_member
    1678                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$25)
    1679                            .dwattr $C$DW$106, DW_AT_name("RANDOM_NUM_3")
    1680                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("RANDOM_NUM_3")
    1681                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    1682                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1683                            .dwattr $C$DW$106, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1684                            .dwattr $C$DW$106, DW_AT_decl_line(0x50e)
    1685                            .dwattr $C$DW$106, DW_AT_decl_column(0x11)
    1686                    
    1687                    $C$DW$107       .dwtag  DW_TAG_member
    1688                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$25)
    1689                            .dwattr $C$DW$107, DW_AT_name("RANDOM_NUM_4")
    1690                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("RANDOM_NUM_4")
    1691                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    1692                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1693                            .dwattr $C$DW$107, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1694                            .dwattr $C$DW$107, DW_AT_decl_line(0x50f)
    1695                            .dwattr $C$DW$107, DW_AT_decl_column(0x11)
    1696                    
    1697                    $C$DW$108       .dwtag  DW_TAG_member
    1698                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$25)
    1699                            .dwattr $C$DW$108, DW_AT_name("BSL_CFG_TAG")
    1700                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("BSL_CFG_TAG")
    1701                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
    1702                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1703                            .dwattr $C$DW$108, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1704                            .dwattr $C$DW$108, DW_AT_decl_line(0x510)
    1705                            .dwattr $C$DW$108, DW_AT_decl_column(0x11)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   32

    1706                    
    1707                    $C$DW$109       .dwtag  DW_TAG_member
    1708                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$25)
    1709                            .dwattr $C$DW$109, DW_AT_name("BSL_CFG_LEN")
    1710                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("BSL_CFG_LEN")
    1711                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    1712                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1713                            .dwattr $C$DW$109, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1714                            .dwattr $C$DW$109, DW_AT_decl_line(0x511)
    1715                            .dwattr $C$DW$109, DW_AT_decl_column(0x11)
    1716                    
    1717                    $C$DW$110       .dwtag  DW_TAG_member
    1718                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$25)
    1719                            .dwattr $C$DW$110, DW_AT_name("BSL_PERIPHIF_SEL")
    1720                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("BSL_PERIPHIF_SEL")
    1721                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    1722                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1723                            .dwattr $C$DW$110, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1724                            .dwattr $C$DW$110, DW_AT_decl_line(0x512)
    1725                            .dwattr $C$DW$110, DW_AT_decl_column(0x11)
    1726                    
    1727                    $C$DW$111       .dwtag  DW_TAG_member
    1728                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$25)
    1729                            .dwattr $C$DW$111, DW_AT_name("BSL_PORTIF_CFG_UART")
    1730                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_UART")
    1731                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    1732                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1733                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1734                            .dwattr $C$DW$111, DW_AT_decl_line(0x513)
    1735                            .dwattr $C$DW$111, DW_AT_decl_column(0x11)
    1736                    
    1737                    $C$DW$112       .dwtag  DW_TAG_member
    1738                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$25)
    1739                            .dwattr $C$DW$112, DW_AT_name("BSL_PORTIF_CFG_SPI")
    1740                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_SPI")
    1741                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    1742                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1743                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1744                            .dwattr $C$DW$112, DW_AT_decl_line(0x514)
    1745                            .dwattr $C$DW$112, DW_AT_decl_column(0x11)
    1746                    
    1747                    $C$DW$113       .dwtag  DW_TAG_member
    1748                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$25)
    1749                            .dwattr $C$DW$113, DW_AT_name("BSL_PORTIF_CFG_I2C")
    1750                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_I2C")
    1751                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
    1752                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1753                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1754                            .dwattr $C$DW$113, DW_AT_decl_line(0x515)
    1755                            .dwattr $C$DW$113, DW_AT_decl_column(0x11)
    1756                    
    1757                    $C$DW$114       .dwtag  DW_TAG_member
    1758                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$25)
    1759                            .dwattr $C$DW$114, DW_AT_name("TLV_END")
    1760                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("TLV_END")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:16:56 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   33

    1761                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
    1762                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1763                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1764                            .dwattr $C$DW$114, DW_AT_decl_line(0x516)
    1765                            .dwattr $C$DW$114, DW_AT_decl_column(0x11)
    1766                    
    1767                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1768                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x4c3)
    1769                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    1770                            .dwendtag $C$DW$T$28
    1771                    
    1772                    $C$DW$T$181     .dwtag  DW_TAG_typedef
    1773                            .dwattr $C$DW$T$181, DW_AT_name("TLV_Type")
    1774                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$28)
    1775                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    1776                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1777                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x517)
    1778                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x03)
    1779                    
    1780                    
    1781                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1782                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x8c)
    1783                    $C$DW$115       .dwtag  DW_TAG_member
    1784                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$25)
    1785                            .dwattr $C$DW$115, DW_AT_name("CPUID")
    1786                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("CPUID")
    1787                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1788                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1789                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1790                            .dwattr $C$DW$115, DW_AT_decl_line(0x1b8)
    1791                            .dwattr $C$DW$115, DW_AT_decl_column(0x12)
    1792                    
    1793                    $C$DW$116       .dwtag  DW_TAG_member
    1794                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$23)
    1795                            .dwattr $C$DW$116, DW_AT_name("ICSR")
    1796                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("ICSR")
    1797                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1798                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1799                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1800                            .dwattr $C$DW$116, DW_AT_decl_line(0x1b9)
    1801                            .dwattr $C$DW$116, DW_AT_decl_column(0x12)
    1802                    
    1803                    $C$DW$117       .dwtag  DW_TAG_member
    1804                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$23)
