TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                              PC v20.2.6.LTS *
       3                    ;* Date/Time created: Mon Oct 31 23:17:02 2022                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../InputOutput.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v20.2.6.LTS Copyright (c) 1996
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Y2S1\SC2107 Lab\Lab1ref_InputOutput\Debug")
      13                    ;       C:\ti\ccs1200\ccs\tools\compiler\ti-cgt-arm_20.2.6.LTS\bin\armacpia.exe -@C:\\Users\\daych\\Ap

     530                    ;* --------------------------------------------------------------------------*
     531 000000dc E7D3              B         ||$C$L1||             ; [DPU_V7M3_PIPE] |115|  ; [ORIG 16-BIT INS]
     532                            ; BRANCH OCCURS {||$C$L1||}      ; [] |115| 
     533                    ;* --------------------------------------------------------------------------*
     534                            .dwattr $C$DW$15, DW_AT_TI_end_file("../InputOutput.c")
     535                            .dwattr $C$DW$15, DW_AT_TI_end_line(0x86)
     536                            .dwattr $C$DW$15, DW_AT_TI_end_column(0x01)
     537                            .dwendentry
     538                            .dwendtag $C$DW$15
     539                    
     540                    ;******************************************************************************
     541                    ;* CONSTANT TABLE                                                             *
     542                    ;******************************************************************************
     543 000000de                   .sect   ".text"
     544                            .align  4
     545 000000de 4C0A46C0  ||$C$CON1||:    .bits           0x40004c0a,32
         000000e2 00004000 
     546                    
     547                            .align  4
     548 000000e2 4C0C4000  ||$C$CON2||:    .bits           0x40004c0c,32
         000000e6 00004000 
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   11

     549                    
     550                            .align  4
     551 000000e6 4C044000  ||$C$CON3||:    .bits           0x40004c04,32
         000000ea 00004000 
     552                    
     553                            .align  4
     554 000000ea 4C064000  ||$C$CON4||:    .bits           0x40004c06,32
         000000ee 00004000 
     555                    
     556                            .align  4
     557 000000ee 4C024000  ||$C$CON5||:    .bits           0x40004c02,32
         000000f2 00004000 
     558                    
     559                            .align  4
     560 000000f2 4C004000  ||$C$CON6||:    .bits           0x40004c00,32
         000000f6 00004000 
     561                    
     562                            .align  4
     563 000000f6 4C0B4000  ||$C$CON7||:    .bits           0x40004c0b,32
         000000fa 00004000 
     564                    
     565                            .align  4
     566 000000fa 4C0D4000  ||$C$CON8||:    .bits           0x40004c0d,32
         000000fe 00004000 
     567                    
     568                            .align  4
     569 000000fe 4C094000  ||$C$CON9||:    .bits           0x40004c09,32
         00000102 00004000 
     570                    
     571                            .align  4
     572 00000102 4C054000  ||$C$CON10||:   .bits           0x40004c05,32
         00000106 00004000 
     573                    
     574                            .align  4
     575 00000106 4C034000  ||$C$CON11||:   .bits           0x40004c03,32
         0000010a 00004000 
     576                    
     577                    
     578                    ;******************************************************************************
     579                    ;* BUILD ATTRIBUTES                                                           *
     580                    ;******************************************************************************
     581                            .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     582                            .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0111111111100000000000000
     583                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     584                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     585                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     586                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     587                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     588                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     589                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
     590                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     591                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     592                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     593                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     594                    
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   12

     595                    ;******************************************************************************
     596                    ;* TYPE INFORMATION                                                           *
     597                    ;******************************************************************************
     598                    
     599                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
     600                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1e)
     601                    $C$DW$28        .dwtag  DW_TAG_member
     602                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$23)
     603                            .dwattr $C$DW$28, DW_AT_name("IN")
     604                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("IN")
     605                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     606                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     607                            .dwattr $C$DW$28, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     608                            .dwattr $C$DW$28, DW_AT_decl_line(0x288)
     609                            .dwattr $C$DW$28, DW_AT_decl_column(0x0f)
     610                    
     611                    $C$DW$29        .dwtag  DW_TAG_member
     612                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$22)
     613                            .dwattr $C$DW$29, DW_AT_name("RESERVED0")
     614                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("RESERVED0")
     615                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     616                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     617                            .dwattr $C$DW$29, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     618                            .dwattr $C$DW$29, DW_AT_decl_line(0x289)
     619                            .dwattr $C$DW$29, DW_AT_decl_column(0x0b)
     620                    
     621                    $C$DW$30        .dwtag  DW_TAG_member
     622                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$24)
     623                            .dwattr $C$DW$30, DW_AT_name("OUT")
     624                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("OUT")
     625                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     626                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     627                            .dwattr $C$DW$30, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     628                            .dwattr $C$DW$30, DW_AT_decl_line(0x28a)
     629                            .dwattr $C$DW$30, DW_AT_decl_column(0x10)
     630                    
     631                    $C$DW$31        .dwtag  DW_TAG_member
     632                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$22)
     633                            .dwattr $C$DW$31, DW_AT_name("RESERVED1")
     634                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("RESERVED1")
     635                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     636                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     637                            .dwattr $C$DW$31, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     638                            .dwattr $C$DW$31, DW_AT_decl_line(0x28b)
     639                            .dwattr $C$DW$31, DW_AT_decl_column(0x0b)
     640                    
     641                    $C$DW$32        .dwtag  DW_TAG_member
     642                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$24)
     643                            .dwattr $C$DW$32, DW_AT_name("DIR")
     644                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("DIR")
     645                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     646                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     647                            .dwattr $C$DW$32, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     648                            .dwattr $C$DW$32, DW_AT_decl_line(0x28c)
     649                            .dwattr $C$DW$32, DW_AT_decl_column(0x10)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   13

     650                    
     651                    $C$DW$33        .dwtag  DW_TAG_member
     652                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$22)
     653                            .dwattr $C$DW$33, DW_AT_name("RESERVED2")
     654                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("RESERVED2")
     655                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     656                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     657                            .dwattr $C$DW$33, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     658                            .dwattr $C$DW$33, DW_AT_decl_line(0x28d)
     659                            .dwattr $C$DW$33, DW_AT_decl_column(0x0b)
     660                    
     661                    $C$DW$34        .dwtag  DW_TAG_member
     662                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$24)
     663                            .dwattr $C$DW$34, DW_AT_name("REN")
     664                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("REN")
     665                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     666                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     667                            .dwattr $C$DW$34, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     668                            .dwattr $C$DW$34, DW_AT_decl_line(0x28e)
     669                            .dwattr $C$DW$34, DW_AT_decl_column(0x10)
     670                    
     671                    $C$DW$35        .dwtag  DW_TAG_member
     672                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$22)
     673                            .dwattr $C$DW$35, DW_AT_name("RESERVED3")
     674                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("RESERVED3")
     675                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     676                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     677                            .dwattr $C$DW$35, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     678                            .dwattr $C$DW$35, DW_AT_decl_line(0x28f)
     679                            .dwattr $C$DW$35, DW_AT_decl_column(0x0b)
     680                    
     681                    $C$DW$36        .dwtag  DW_TAG_member
     682                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$24)
     683                            .dwattr $C$DW$36, DW_AT_name("DS")
     684                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("DS")
     685                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     686                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     687                            .dwattr $C$DW$36, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     688                            .dwattr $C$DW$36, DW_AT_decl_line(0x290)
     689                            .dwattr $C$DW$36, DW_AT_decl_column(0x10)
     690                    
     691                    $C$DW$37        .dwtag  DW_TAG_member
     692                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$22)
     693                            .dwattr $C$DW$37, DW_AT_name("RESERVED4")
     694                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("RESERVED4")
     695                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     696                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     697                            .dwattr $C$DW$37, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     698                            .dwattr $C$DW$37, DW_AT_decl_line(0x291)
     699                            .dwattr $C$DW$37, DW_AT_decl_column(0x0b)
     700                    
     701                    $C$DW$38        .dwtag  DW_TAG_member
     702                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$24)
     703                            .dwattr $C$DW$38, DW_AT_name("SEL0")
     704                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("SEL0")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   14

     705                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     706                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     707                            .dwattr $C$DW$38, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     708                            .dwattr $C$DW$38, DW_AT_decl_line(0x292)
     709                            .dwattr $C$DW$38, DW_AT_decl_column(0x10)
     710                    
     711                    $C$DW$39        .dwtag  DW_TAG_member
     712                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$22)
     713                            .dwattr $C$DW$39, DW_AT_name("RESERVED5")
     714                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("RESERVED5")
     715                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     716                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     717                            .dwattr $C$DW$39, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     718                            .dwattr $C$DW$39, DW_AT_decl_line(0x293)
     719                            .dwattr $C$DW$39, DW_AT_decl_column(0x0b)
     720                    
     721                    $C$DW$40        .dwtag  DW_TAG_member
     722                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$24)
     723                            .dwattr $C$DW$40, DW_AT_name("SEL1")
     724                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("SEL1")
     725                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     726                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     727                            .dwattr $C$DW$40, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     728                            .dwattr $C$DW$40, DW_AT_decl_line(0x294)
     729                            .dwattr $C$DW$40, DW_AT_decl_column(0x10)
     730                    
     731                    $C$DW$41        .dwtag  DW_TAG_member
     732                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$22)
     733                            .dwattr $C$DW$41, DW_AT_name("RESERVED6")
     734                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("RESERVED6")
     735                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     736                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     737                            .dwattr $C$DW$41, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     738                            .dwattr $C$DW$41, DW_AT_decl_line(0x295)
     739                            .dwattr $C$DW$41, DW_AT_decl_column(0x0b)
     740                    
     741                    $C$DW$42        .dwtag  DW_TAG_member
     742                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$27)
     743                            .dwattr $C$DW$42, DW_AT_name("IV")
     744                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("IV")
     745                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     746                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     747                            .dwattr $C$DW$42, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     748                            .dwattr $C$DW$42, DW_AT_decl_line(0x296)
     749                            .dwattr $C$DW$42, DW_AT_decl_column(0x11)
     750                    
     751                    $C$DW$43        .dwtag  DW_TAG_member
     752                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$28)
     753                            .dwattr $C$DW$43, DW_AT_name("RESERVED7")
     754                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("RESERVED7")
     755                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     756                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     757                            .dwattr $C$DW$43, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     758                            .dwattr $C$DW$43, DW_AT_decl_line(0x297)
     759                            .dwattr $C$DW$43, DW_AT_decl_column(0x0b)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   15

     760                    
     761                    $C$DW$44        .dwtag  DW_TAG_member
     762                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$24)
     763                            .dwattr $C$DW$44, DW_AT_name("SELC")
     764                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("SELC")
     765                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     766                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     767                            .dwattr $C$DW$44, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     768                            .dwattr $C$DW$44, DW_AT_decl_line(0x298)
     769                            .dwattr $C$DW$44, DW_AT_decl_column(0x10)
     770                    
     771                    $C$DW$45        .dwtag  DW_TAG_member
     772                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$22)
     773                            .dwattr $C$DW$45, DW_AT_name("RESERVED8")
     774                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("RESERVED8")
     775                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     776                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     777                            .dwattr $C$DW$45, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     778                            .dwattr $C$DW$45, DW_AT_decl_line(0x299)
     779                            .dwattr $C$DW$45, DW_AT_decl_column(0x0b)
     780                    
     781                    $C$DW$46        .dwtag  DW_TAG_member
     782                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$24)
     783                            .dwattr $C$DW$46, DW_AT_name("IES")
     784                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("IES")
     785                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     786                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     787                            .dwattr $C$DW$46, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     788                            .dwattr $C$DW$46, DW_AT_decl_line(0x29a)
     789                            .dwattr $C$DW$46, DW_AT_decl_column(0x10)
     790                    
     791                    $C$DW$47        .dwtag  DW_TAG_member
     792                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$22)
     793                            .dwattr $C$DW$47, DW_AT_name("RESERVED9")
     794                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("RESERVED9")
     795                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     796                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     797                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     798                            .dwattr $C$DW$47, DW_AT_decl_line(0x29b)
     799                            .dwattr $C$DW$47, DW_AT_decl_column(0x0b)
     800                    
     801                    $C$DW$48        .dwtag  DW_TAG_member
     802                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$24)
     803                            .dwattr $C$DW$48, DW_AT_name("IE")
     804                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("IE")
     805                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     806                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     807                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     808                            .dwattr $C$DW$48, DW_AT_decl_line(0x29c)
     809                            .dwattr $C$DW$48, DW_AT_decl_column(0x10)
     810                    
     811                    $C$DW$49        .dwtag  DW_TAG_member
     812                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$22)
     813                            .dwattr $C$DW$49, DW_AT_name("RESERVED10")
     814                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("RESERVED10")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   16

     815                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     816                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     817                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     818                            .dwattr $C$DW$49, DW_AT_decl_line(0x29d)
     819                            .dwattr $C$DW$49, DW_AT_decl_column(0x0b)
     820                    
     821                    $C$DW$50        .dwtag  DW_TAG_member
     822                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$24)
     823                            .dwattr $C$DW$50, DW_AT_name("IFG")
     824                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("IFG")
     825                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     826                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     827                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     828                            .dwattr $C$DW$50, DW_AT_decl_line(0x29e)
     829                            .dwattr $C$DW$50, DW_AT_decl_column(0x10)
     830                    
     831                    $C$DW$51        .dwtag  DW_TAG_member
     832                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$22)
     833                            .dwattr $C$DW$51, DW_AT_name("RESERVED11")
     834                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("RESERVED11")
     835                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
     836                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     837                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     838                            .dwattr $C$DW$51, DW_AT_decl_line(0x29f)
     839                            .dwattr $C$DW$51, DW_AT_decl_column(0x0b)
     840                    
     841                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     842                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x287)
     843                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
     844                            .dwendtag $C$DW$T$29
     845                    
     846                    $C$DW$T$179     .dwtag  DW_TAG_typedef
     847                            .dwattr $C$DW$T$179, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
     848                            .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$29)
     849                            .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
     850                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     851                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x2a0)
     852                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x03)
     853                    
     854                    
     855                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
     856                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x20)
     857                    $C$DW$52        .dwtag  DW_TAG_member
     858                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$22)
     859                            .dwattr $C$DW$52, DW_AT_name("RESERVED0")
     860                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("RESERVED0")
     861                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     863                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     864                            .dwattr $C$DW$52, DW_AT_decl_line(0x2a3)
     865                            .dwattr $C$DW$52, DW_AT_decl_column(0x0b)
     866                    
     867                    $C$DW$53        .dwtag  DW_TAG_member
     868                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$23)
     869                            .dwattr $C$DW$53, DW_AT_name("IN")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   17

     870                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("IN")
     871                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     872                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     873                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     874                            .dwattr $C$DW$53, DW_AT_decl_line(0x2a4)
     875                            .dwattr $C$DW$53, DW_AT_decl_column(0x0f)
     876                    
     877                    $C$DW$54        .dwtag  DW_TAG_member
     878                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$22)
     879                            .dwattr $C$DW$54, DW_AT_name("RESERVED1")
     880                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("RESERVED1")
     881                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     882                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     883                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     884                            .dwattr $C$DW$54, DW_AT_decl_line(0x2a5)
     885                            .dwattr $C$DW$54, DW_AT_decl_column(0x0b)
     886                    
     887                    $C$DW$55        .dwtag  DW_TAG_member
     888                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$24)
     889                            .dwattr $C$DW$55, DW_AT_name("OUT")
     890                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("OUT")
     891                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     892                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     893                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     894                            .dwattr $C$DW$55, DW_AT_decl_line(0x2a6)
     895                            .dwattr $C$DW$55, DW_AT_decl_column(0x10)
     896                    
     897                    $C$DW$56        .dwtag  DW_TAG_member
     898                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$22)
     899                            .dwattr $C$DW$56, DW_AT_name("RESERVED2")
     900                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("RESERVED2")
     901                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     902                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     903                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     904                            .dwattr $C$DW$56, DW_AT_decl_line(0x2a7)
     905                            .dwattr $C$DW$56, DW_AT_decl_column(0x0b)
     906                    
     907                    $C$DW$57        .dwtag  DW_TAG_member
     908                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$24)
     909                            .dwattr $C$DW$57, DW_AT_name("DIR")
     910                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("DIR")
     911                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     912                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     913                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     914                            .dwattr $C$DW$57, DW_AT_decl_line(0x2a8)
     915                            .dwattr $C$DW$57, DW_AT_decl_column(0x10)
     916                    
     917                    $C$DW$58        .dwtag  DW_TAG_member
     918                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$22)
     919                            .dwattr $C$DW$58, DW_AT_name("RESERVED3")
     920                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("RESERVED3")
     921                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     922                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     923                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     924                            .dwattr $C$DW$58, DW_AT_decl_line(0x2a9)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   18

     925                            .dwattr $C$DW$58, DW_AT_decl_column(0x0b)
     926                    
     927                    $C$DW$59        .dwtag  DW_TAG_member
     928                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$24)
     929                            .dwattr $C$DW$59, DW_AT_name("REN")
     930                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("REN")
     931                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     932                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     933                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     934                            .dwattr $C$DW$59, DW_AT_decl_line(0x2aa)
     935                            .dwattr $C$DW$59, DW_AT_decl_column(0x10)
     936                    
     937                    $C$DW$60        .dwtag  DW_TAG_member
     938                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$22)
     939                            .dwattr $C$DW$60, DW_AT_name("RESERVED4")
     940                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("RESERVED4")
     941                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     942                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     943                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     944                            .dwattr $C$DW$60, DW_AT_decl_line(0x2ab)
     945                            .dwattr $C$DW$60, DW_AT_decl_column(0x0b)
     946                    
     947                    $C$DW$61        .dwtag  DW_TAG_member
     948                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$24)
     949                            .dwattr $C$DW$61, DW_AT_name("DS")
     950                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("DS")
     951                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     952                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     953                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     954                            .dwattr $C$DW$61, DW_AT_decl_line(0x2ac)
     955                            .dwattr $C$DW$61, DW_AT_decl_column(0x10)
     956                    
     957                    $C$DW$62        .dwtag  DW_TAG_member
     958                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$22)
     959                            .dwattr $C$DW$62, DW_AT_name("RESERVED5")
     960                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("RESERVED5")
     961                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     962                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     963                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     964                            .dwattr $C$DW$62, DW_AT_decl_line(0x2ad)
     965                            .dwattr $C$DW$62, DW_AT_decl_column(0x0b)
     966                    
     967                    $C$DW$63        .dwtag  DW_TAG_member
     968                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$24)
     969                            .dwattr $C$DW$63, DW_AT_name("SEL0")
     970                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("SEL0")
     971                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     972                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     973                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     974                            .dwattr $C$DW$63, DW_AT_decl_line(0x2ae)
     975                            .dwattr $C$DW$63, DW_AT_decl_column(0x10)
     976                    
     977                    $C$DW$64        .dwtag  DW_TAG_member
     978                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$22)
     979                            .dwattr $C$DW$64, DW_AT_name("RESERVED6")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   19

     980                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("RESERVED6")
     981                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     982                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     983                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     984                            .dwattr $C$DW$64, DW_AT_decl_line(0x2af)
     985                            .dwattr $C$DW$64, DW_AT_decl_column(0x0b)
     986                    
     987                    $C$DW$65        .dwtag  DW_TAG_member
     988                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$24)
     989                            .dwattr $C$DW$65, DW_AT_name("SEL1")
     990                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("SEL1")
     991                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     992                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     993                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
     994                            .dwattr $C$DW$65, DW_AT_decl_line(0x2b0)
     995                            .dwattr $C$DW$65, DW_AT_decl_column(0x10)
     996                    
     997                    $C$DW$66        .dwtag  DW_TAG_member
     998                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$30)
     999                            .dwattr $C$DW$66, DW_AT_name("RESERVED7")
    1000                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("RESERVED7")
    1001                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1002                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1003                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1004                            .dwattr $C$DW$66, DW_AT_decl_line(0x2b1)
    1005                            .dwattr $C$DW$66, DW_AT_decl_column(0x0b)
    1006                    
    1007                    $C$DW$67        .dwtag  DW_TAG_member
    1008                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$24)
    1009                            .dwattr $C$DW$67, DW_AT_name("SELC")
    1010                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("SELC")
    1011                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1012                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1013                            .dwattr $C$DW$67, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1014                            .dwattr $C$DW$67, DW_AT_decl_line(0x2b2)
    1015                            .dwattr $C$DW$67, DW_AT_decl_column(0x10)
    1016                    
    1017                    $C$DW$68        .dwtag  DW_TAG_member
    1018                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$22)
    1019                            .dwattr $C$DW$68, DW_AT_name("RESERVED8")
    1020                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("RESERVED8")
    1021                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1022                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1023                            .dwattr $C$DW$68, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1024                            .dwattr $C$DW$68, DW_AT_decl_line(0x2b3)
    1025                            .dwattr $C$DW$68, DW_AT_decl_column(0x0b)
    1026                    
    1027                    $C$DW$69        .dwtag  DW_TAG_member
    1028                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$24)
    1029                            .dwattr $C$DW$69, DW_AT_name("IES")
    1030                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("IES")
    1031                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1032                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1033                            .dwattr $C$DW$69, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1034                            .dwattr $C$DW$69, DW_AT_decl_line(0x2b4)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   20

    1035                            .dwattr $C$DW$69, DW_AT_decl_column(0x10)
    1036                    
    1037                    $C$DW$70        .dwtag  DW_TAG_member
    1038                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$22)
    1039                            .dwattr $C$DW$70, DW_AT_name("RESERVED9")
    1040                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("RESERVED9")
    1041                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1042                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1043                            .dwattr $C$DW$70, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1044                            .dwattr $C$DW$70, DW_AT_decl_line(0x2b5)
    1045                            .dwattr $C$DW$70, DW_AT_decl_column(0x0b)
    1046                    
    1047                    $C$DW$71        .dwtag  DW_TAG_member
    1048                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$24)
    1049                            .dwattr $C$DW$71, DW_AT_name("IE")
    1050                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("IE")
    1051                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1052                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1053                            .dwattr $C$DW$71, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1054                            .dwattr $C$DW$71, DW_AT_decl_line(0x2b6)
    1055                            .dwattr $C$DW$71, DW_AT_decl_column(0x10)
    1056                    
    1057                    $C$DW$72        .dwtag  DW_TAG_member
    1058                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$22)
    1059                            .dwattr $C$DW$72, DW_AT_name("RESERVED10")
    1060                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("RESERVED10")
    1061                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1062                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1063                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1064                            .dwattr $C$DW$72, DW_AT_decl_line(0x2b7)
    1065                            .dwattr $C$DW$72, DW_AT_decl_column(0x0b)
    1066                    
    1067                    $C$DW$73        .dwtag  DW_TAG_member
    1068                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$24)
    1069                            .dwattr $C$DW$73, DW_AT_name("IFG")
    1070                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("IFG")
    1071                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1072                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1073                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1074                            .dwattr $C$DW$73, DW_AT_decl_line(0x2b8)
    1075                            .dwattr $C$DW$73, DW_AT_decl_column(0x10)
    1076                    
    1077                    $C$DW$74        .dwtag  DW_TAG_member
    1078                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$27)
    1079                            .dwattr $C$DW$74, DW_AT_name("IV")
    1080                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("IV")
    1081                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1082                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1083                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1084                            .dwattr $C$DW$74, DW_AT_decl_line(0x2b9)
    1085                            .dwattr $C$DW$74, DW_AT_decl_column(0x10)
    1086                    
    1087                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1088                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x2a2)
    1089                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   21

    1090                            .dwendtag $C$DW$T$31
    1091                    
    1092                    $C$DW$T$181     .dwtag  DW_TAG_typedef
    1093                            .dwattr $C$DW$T$181, DW_AT_name("DIO_PORT_Even_Interruptable_Type")
    1094                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$31)
    1095                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    1096                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:\ti\ccs1200\ccs\ccs_base\arm\include\msp432p401r.h")
    1097                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x2ba)
    1098                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x03)
    1099                    
    1100                    
    1101                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1102                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    1103                    $C$DW$75        .dwtag  DW_TAG_member
    1104                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$14)
    1105                            .dwattr $C$DW$75, DW_AT_name("__max_align1")
    1106                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("__max_align1")
    1107                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1108                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1109                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti/ccs1200/ccs/tools/compiler/ti-cgt-arm_20.2.6.LTS/incl
    1110                            .dwattr $C$DW$75, DW_AT_decl_line(0x7b)
    1111                            .dwattr $C$DW$75, DW_AT_decl_column(0x0c)
    1112                    
    1113                    $C$DW$76        .dwtag  DW_TAG_member
    1114                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$18)
    1115                            .dwattr $C$DW$76, DW_AT_name("__max_align2")
    1116                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("__max_align2")
    1117                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1118                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1119                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/ccs1200/ccs/tools/compiler/ti-cgt-arm_20.2.6.LTS/incl
    1120                            .dwattr $C$DW$76, DW_AT_decl_line(0x7c)
    1121                            .dwattr $C$DW$76, DW_AT_decl_column(0x0e)
    1122                    
    1123                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/ccs1200/ccs/tools/compiler/ti-cgt-arm_20.2.6.LTS/in
    1124                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7a)
    1125                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    1126                            .dwendtag $C$DW$T$32
    1127                    
    1128                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    1129                            .dwattr $C$DW$T$183, DW_AT_name("__max_align_t")
    1130                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$32)
    1131                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    1132                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/ccs1200/ccs/tools/compiler/ti-cgt-arm_20.2.6.LTS/i
    1133                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x7d)
    1134                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x03)
    1135                    
    1136                    
    1137                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1138                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    1139                    $C$DW$77        .dwtag  DW_TAG_member
    1140                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$34)
    1141                            .dwattr $C$DW$77, DW_AT_name("_reserved0")
    1142                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("_reserved0")
    1143                            .dwattr $C$DW$77, DW_AT_bit_offset(0x10)
    1144                            .dwattr $C$DW$77, DW_AT_bit_size(0x10)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   22

    1145                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1146                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1147                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1148                            .dwattr $C$DW$77, DW_AT_decl_line(0x105)
    1149                            .dwattr $C$DW$77, DW_AT_decl_column(0x0e)
    1150                    
    1151                    $C$DW$78        .dwtag  DW_TAG_member
    1152                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$34)
    1153                            .dwattr $C$DW$78, DW_AT_name("GE")
    1154                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("GE")
    1155                            .dwattr $C$DW$78, DW_AT_bit_offset(0x0c)
    1156                            .dwattr $C$DW$78, DW_AT_bit_size(0x04)
    1157                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1158                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1159                            .dwattr $C$DW$78, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1160                            .dwattr $C$DW$78, DW_AT_decl_line(0x106)
    1161                            .dwattr $C$DW$78, DW_AT_decl_column(0x0e)
    1162                    
    1163                    $C$DW$79        .dwtag  DW_TAG_member
    1164                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$34)
    1165                            .dwattr $C$DW$79, DW_AT_name("_reserved1")
    1166                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("_reserved1")
    1167                            .dwattr $C$DW$79, DW_AT_bit_offset(0x05)
    1168                            .dwattr $C$DW$79, DW_AT_bit_size(0x07)
    1169                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1170                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1171                            .dwattr $C$DW$79, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1172                            .dwattr $C$DW$79, DW_AT_decl_line(0x107)
    1173                            .dwattr $C$DW$79, DW_AT_decl_column(0x0e)
    1174                    
    1175                    $C$DW$80        .dwtag  DW_TAG_member
    1176                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$34)
    1177                            .dwattr $C$DW$80, DW_AT_name("Q")
    1178                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("Q")
    1179                            .dwattr $C$DW$80, DW_AT_bit_offset(0x04)
    1180                            .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1181                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1182                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1183                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1184                            .dwattr $C$DW$80, DW_AT_decl_line(0x108)
    1185                            .dwattr $C$DW$80, DW_AT_decl_column(0x0e)
    1186                    
    1187                    $C$DW$81        .dwtag  DW_TAG_member
    1188                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$34)
    1189                            .dwattr $C$DW$81, DW_AT_name("V")
    1190                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("V")
    1191                            .dwattr $C$DW$81, DW_AT_bit_offset(0x03)
    1192                            .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1193                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1194                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1195                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1196                            .dwattr $C$DW$81, DW_AT_decl_line(0x109)
    1197                            .dwattr $C$DW$81, DW_AT_decl_column(0x0e)
    1198                    
    1199                    $C$DW$82        .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   23

    1200                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$34)
    1201                            .dwattr $C$DW$82, DW_AT_name("C")
    1202                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("C")
    1203                            .dwattr $C$DW$82, DW_AT_bit_offset(0x02)
    1204                            .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1205                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1206                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1207                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1208                            .dwattr $C$DW$82, DW_AT_decl_line(0x10a)
    1209                            .dwattr $C$DW$82, DW_AT_decl_column(0x0e)
    1210                    
    1211                    $C$DW$83        .dwtag  DW_TAG_member
    1212                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$34)
    1213                            .dwattr $C$DW$83, DW_AT_name("Z")
    1214                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("Z")
    1215                            .dwattr $C$DW$83, DW_AT_bit_offset(0x01)
    1216                            .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1217                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1219                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1220                            .dwattr $C$DW$83, DW_AT_decl_line(0x10b)
    1221                            .dwattr $C$DW$83, DW_AT_decl_column(0x0e)
    1222                    
    1223                    $C$DW$84        .dwtag  DW_TAG_member
    1224                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$34)
    1225                            .dwattr $C$DW$84, DW_AT_name("N")
    1226                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("N")
    1227                            .dwattr $C$DW$84, DW_AT_bit_offset(0x00)
    1228                            .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1229                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1230                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1231                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1232                            .dwattr $C$DW$84, DW_AT_decl_line(0x10c)
    1233                            .dwattr $C$DW$84, DW_AT_decl_column(0x0e)
    1234                    
    1235                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1236                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x104)
    1237                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    1238                            .dwendtag $C$DW$T$35
    1239                    
    1240                    
    1241                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1242                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1243                    $C$DW$85        .dwtag  DW_TAG_member
    1244                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$34)
    1245                            .dwattr $C$DW$85, DW_AT_name("ISR")
    1246                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("ISR")
    1247                            .dwattr $C$DW$85, DW_AT_bit_offset(0x17)
    1248                            .dwattr $C$DW$85, DW_AT_bit_size(0x09)
    1249                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1250                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1251                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1252                            .dwattr $C$DW$85, DW_AT_decl_line(0x12c)
    1253                            .dwattr $C$DW$85, DW_AT_decl_column(0x0e)
    1254                    
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   24

    1255                    $C$DW$86        .dwtag  DW_TAG_member
    1256                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$34)
    1257                            .dwattr $C$DW$86, DW_AT_name("_reserved0")
    1258                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("_reserved0")
    1259                            .dwattr $C$DW$86, DW_AT_bit_offset(0x00)
    1260                            .dwattr $C$DW$86, DW_AT_bit_size(0x17)
    1261                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1262                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1263                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1264                            .dwattr $C$DW$86, DW_AT_decl_line(0x12d)
    1265                            .dwattr $C$DW$86, DW_AT_decl_column(0x0e)
    1266                    
    1267                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1268                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x12b)
    1269                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
    1270                            .dwendtag $C$DW$T$36
    1271                    
    1272                    
    1273                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1274                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1275                    $C$DW$87        .dwtag  DW_TAG_member
    1276                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$34)
    1277                            .dwattr $C$DW$87, DW_AT_name("ISR")
    1278                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("ISR")
    1279                            .dwattr $C$DW$87, DW_AT_bit_offset(0x17)
    1280                            .dwattr $C$DW$87, DW_AT_bit_size(0x09)
    1281                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1282                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1283                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1284                            .dwattr $C$DW$87, DW_AT_decl_line(0x13e)
    1285                            .dwattr $C$DW$87, DW_AT_decl_column(0x0e)
    1286                    
    1287                    $C$DW$88        .dwtag  DW_TAG_member
    1288                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$34)
    1289                            .dwattr $C$DW$88, DW_AT_name("_reserved0")
    1290                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("_reserved0")
    1291                            .dwattr $C$DW$88, DW_AT_bit_offset(0x16)
    1292                            .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1293                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1294                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1295                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1296                            .dwattr $C$DW$88, DW_AT_decl_line(0x13f)
    1297                            .dwattr $C$DW$88, DW_AT_decl_column(0x0e)
    1298                    
    1299                    $C$DW$89        .dwtag  DW_TAG_member
    1300                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$34)
    1301                            .dwattr $C$DW$89, DW_AT_name("ICI_IT_1")
    1302                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("ICI_IT_1")
    1303                            .dwattr $C$DW$89, DW_AT_bit_offset(0x10)
    1304                            .dwattr $C$DW$89, DW_AT_bit_size(0x06)
    1305                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1307                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1308                            .dwattr $C$DW$89, DW_AT_decl_line(0x140)
    1309                            .dwattr $C$DW$89, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   25

    1310                    
    1311                    $C$DW$90        .dwtag  DW_TAG_member
    1312                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$34)
    1313                            .dwattr $C$DW$90, DW_AT_name("GE")
    1314                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("GE")
    1315                            .dwattr $C$DW$90, DW_AT_bit_offset(0x0c)
    1316                            .dwattr $C$DW$90, DW_AT_bit_size(0x04)
    1317                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1318                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1319                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1320                            .dwattr $C$DW$90, DW_AT_decl_line(0x141)
    1321                            .dwattr $C$DW$90, DW_AT_decl_column(0x0e)
    1322                    
    1323                    $C$DW$91        .dwtag  DW_TAG_member
    1324                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$34)
    1325                            .dwattr $C$DW$91, DW_AT_name("_reserved1")
    1326                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("_reserved1")
    1327                            .dwattr $C$DW$91, DW_AT_bit_offset(0x08)
    1328                            .dwattr $C$DW$91, DW_AT_bit_size(0x04)
    1329                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1331                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1332                            .dwattr $C$DW$91, DW_AT_decl_line(0x142)
    1333                            .dwattr $C$DW$91, DW_AT_decl_column(0x0e)
    1334                    
    1335                    $C$DW$92        .dwtag  DW_TAG_member
    1336                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$34)
    1337                            .dwattr $C$DW$92, DW_AT_name("T")
    1338                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("T")
    1339                            .dwattr $C$DW$92, DW_AT_bit_offset(0x07)
    1340                            .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1341                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1343                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1344                            .dwattr $C$DW$92, DW_AT_decl_line(0x143)
    1345                            .dwattr $C$DW$92, DW_AT_decl_column(0x0e)
    1346                    
    1347                    $C$DW$93        .dwtag  DW_TAG_member
    1348                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$34)
    1349                            .dwattr $C$DW$93, DW_AT_name("ICI_IT_2")
    1350                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("ICI_IT_2")
    1351                            .dwattr $C$DW$93, DW_AT_bit_offset(0x05)
    1352                            .dwattr $C$DW$93, DW_AT_bit_size(0x02)
    1353                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1354                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1355                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1356                            .dwattr $C$DW$93, DW_AT_decl_line(0x144)
    1357                            .dwattr $C$DW$93, DW_AT_decl_column(0x0e)
    1358                    
    1359                    $C$DW$94        .dwtag  DW_TAG_member
    1360                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$34)
    1361                            .dwattr $C$DW$94, DW_AT_name("Q")
    1362                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("Q")
    1363                            .dwattr $C$DW$94, DW_AT_bit_offset(0x04)
    1364                            .dwattr $C$DW$94, DW_AT_bit_size(0x01)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   26

    1365                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1367                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1368                            .dwattr $C$DW$94, DW_AT_decl_line(0x145)
    1369                            .dwattr $C$DW$94, DW_AT_decl_column(0x0e)
    1370                    
    1371                    $C$DW$95        .dwtag  DW_TAG_member
    1372                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$34)
    1373                            .dwattr $C$DW$95, DW_AT_name("V")
    1374                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("V")
    1375                            .dwattr $C$DW$95, DW_AT_bit_offset(0x03)
    1376                            .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1377                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1379                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1380                            .dwattr $C$DW$95, DW_AT_decl_line(0x146)
    1381                            .dwattr $C$DW$95, DW_AT_decl_column(0x0e)
    1382                    
    1383                    $C$DW$96        .dwtag  DW_TAG_member
    1384                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$34)
    1385                            .dwattr $C$DW$96, DW_AT_name("C")
    1386                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("C")
    1387                            .dwattr $C$DW$96, DW_AT_bit_offset(0x02)
    1388                            .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1389                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1390                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1391                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1392                            .dwattr $C$DW$96, DW_AT_decl_line(0x147)
    1393                            .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1394                    
    1395                    $C$DW$97        .dwtag  DW_TAG_member
    1396                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$34)
    1397                            .dwattr $C$DW$97, DW_AT_name("Z")
    1398                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("Z")
    1399                            .dwattr $C$DW$97, DW_AT_bit_offset(0x01)
    1400                            .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1401                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1403                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1404                            .dwattr $C$DW$97, DW_AT_decl_line(0x148)
    1405                            .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1406                    
    1407                    $C$DW$98        .dwtag  DW_TAG_member
    1408                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$34)
    1409                            .dwattr $C$DW$98, DW_AT_name("N")
    1410                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("N")
    1411                            .dwattr $C$DW$98, DW_AT_bit_offset(0x00)
    1412                            .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1413                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1414                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1415                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1416                            .dwattr $C$DW$98, DW_AT_decl_line(0x149)
    1417                            .dwattr $C$DW$98, DW_AT_decl_column(0x0e)
    1418                    
    1419                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   27

    1420                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x13d)
    1421                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    1422                            .dwendtag $C$DW$T$37
    1423                    
    1424                    
    1425                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1426                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1427                    $C$DW$99        .dwtag  DW_TAG_member
    1428                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$34)
    1429                            .dwattr $C$DW$99, DW_AT_name("nPRIV")
    1430                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("nPRIV")
    1431                            .dwattr $C$DW$99, DW_AT_bit_offset(0x1f)
    1432                            .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1433                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1434                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1435                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1436                            .dwattr $C$DW$99, DW_AT_decl_line(0x175)
    1437                            .dwattr $C$DW$99, DW_AT_decl_column(0x0e)
    1438                    
    1439                    $C$DW$100       .dwtag  DW_TAG_member
    1440                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$34)
    1441                            .dwattr $C$DW$100, DW_AT_name("SPSEL")
    1442                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("SPSEL")
    1443                            .dwattr $C$DW$100, DW_AT_bit_offset(0x1e)
    1444                            .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1445                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1446                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1447                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1448                            .dwattr $C$DW$100, DW_AT_decl_line(0x176)
    1449                            .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1450                    
    1451                    $C$DW$101       .dwtag  DW_TAG_member
    1452                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$34)
    1453                            .dwattr $C$DW$101, DW_AT_name("FPCA")
    1454                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("FPCA")
    1455                            .dwattr $C$DW$101, DW_AT_bit_offset(0x1d)
    1456                            .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1457                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1459                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1460                            .dwattr $C$DW$101, DW_AT_decl_line(0x177)
    1461                            .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1462                    
    1463                    $C$DW$102       .dwtag  DW_TAG_member
    1464                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$34)
    1465                            .dwattr $C$DW$102, DW_AT_name("_reserved0")
    1466                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("_reserved0")
    1467                            .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    1468                            .dwattr $C$DW$102, DW_AT_bit_size(0x1d)
    1469                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1470                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1471                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1472                            .dwattr $C$DW$102, DW_AT_decl_line(0x178)
    1473                            .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    1474                    
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   28

    1475                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1476                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x174)
    1477                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    1478                            .dwendtag $C$DW$T$38
    1479                    
    1480                    
    1481                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1482                            .dwattr $C$DW$T$45, DW_AT_byte_size(0xe04)
    1483                    $C$DW$103       .dwtag  DW_TAG_member
    1484                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$40)
    1485                            .dwattr $C$DW$103, DW_AT_name("ISER")
    1486                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("ISER")
    1487                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1488                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1489                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1490                            .dwattr $C$DW$103, DW_AT_decl_line(0x196)
    1491                            .dwattr $C$DW$103, DW_AT_decl_column(0x12)
    1492                    
    1493                    $C$DW$104       .dwtag  DW_TAG_member
    1494                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$41)
    1495                            .dwattr $C$DW$104, DW_AT_name("RESERVED0")
    1496                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("RESERVED0")
    1497                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1498                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1499                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1500                            .dwattr $C$DW$104, DW_AT_decl_line(0x197)
    1501                            .dwattr $C$DW$104, DW_AT_decl_column(0x12)
    1502                    
    1503                    $C$DW$105       .dwtag  DW_TAG_member
    1504                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$40)
    1505                            .dwattr $C$DW$105, DW_AT_name("ICER")
    1506                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("ICER")
    1507                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1508                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1509                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1510                            .dwattr $C$DW$105, DW_AT_decl_line(0x198)
    1511                            .dwattr $C$DW$105, DW_AT_decl_column(0x12)
    1512                    
    1513                    $C$DW$106       .dwtag  DW_TAG_member
    1514                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$41)
    1515                            .dwattr $C$DW$106, DW_AT_name("RSERVED1")
    1516                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("RSERVED1")
    1517                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1518                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1519                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1520                            .dwattr $C$DW$106, DW_AT_decl_line(0x199)
    1521                            .dwattr $C$DW$106, DW_AT_decl_column(0x12)
    1522                    
    1523                    $C$DW$107       .dwtag  DW_TAG_member
    1524                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$40)
    1525                            .dwattr $C$DW$107, DW_AT_name("ISPR")
    1526                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("ISPR")
    1527                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1528                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1529                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   29

    1530                            .dwattr $C$DW$107, DW_AT_decl_line(0x19a)
    1531                            .dwattr $C$DW$107, DW_AT_decl_column(0x12)
    1532                    
    1533                    $C$DW$108       .dwtag  DW_TAG_member
    1534                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$41)
    1535                            .dwattr $C$DW$108, DW_AT_name("RESERVED2")
    1536                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("RESERVED2")
    1537                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1538                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1539                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1540                            .dwattr $C$DW$108, DW_AT_decl_line(0x19b)
    1541                            .dwattr $C$DW$108, DW_AT_decl_column(0x12)
    1542                    
    1543                    $C$DW$109       .dwtag  DW_TAG_member
    1544                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$40)
    1545                            .dwattr $C$DW$109, DW_AT_name("ICPR")
    1546                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("ICPR")
    1547                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    1548                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1549                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1550                            .dwattr $C$DW$109, DW_AT_decl_line(0x19c)
    1551                            .dwattr $C$DW$109, DW_AT_decl_column(0x12)
    1552                    
    1553                    $C$DW$110       .dwtag  DW_TAG_member
    1554                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$41)
    1555                            .dwattr $C$DW$110, DW_AT_name("RESERVED3")
    1556                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("RESERVED3")
    1557                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    1558                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1559                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1560                            .dwattr $C$DW$110, DW_AT_decl_line(0x19d)
    1561                            .dwattr $C$DW$110, DW_AT_decl_column(0x12)
    1562                    
    1563                    $C$DW$111       .dwtag  DW_TAG_member
    1564                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$40)
    1565                            .dwattr $C$DW$111, DW_AT_name("IABR")
    1566                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("IABR")
    1567                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    1568                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1569                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1570                            .dwattr $C$DW$111, DW_AT_decl_line(0x19e)
    1571                            .dwattr $C$DW$111, DW_AT_decl_column(0x12)
    1572                    
    1573                    $C$DW$112       .dwtag  DW_TAG_member
    1574                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$42)
    1575                            .dwattr $C$DW$112, DW_AT_name("RESERVED4")
    1576                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("RESERVED4")
    1577                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    1578                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1579                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1580                            .dwattr $C$DW$112, DW_AT_decl_line(0x19f)
    1581                            .dwattr $C$DW$112, DW_AT_decl_column(0x12)
    1582                    
    1583                    $C$DW$113       .dwtag  DW_TAG_member
    1584                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$43)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   30

    1585                            .dwattr $C$DW$113, DW_AT_name("IP")
    1586                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("IP")
    1587                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    1588                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1589                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1590                            .dwattr $C$DW$113, DW_AT_decl_line(0x1a0)
    1591                            .dwattr $C$DW$113, DW_AT_decl_column(0x12)
    1592                    
    1593                    $C$DW$114       .dwtag  DW_TAG_member
    1594                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$44)
    1595                            .dwattr $C$DW$114, DW_AT_name("RESERVED5")
    1596                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("RESERVED5")
    1597                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    1598                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1599                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1600                            .dwattr $C$DW$114, DW_AT_decl_line(0x1a1)
    1601                            .dwattr $C$DW$114, DW_AT_decl_column(0x12)
    1602                    
    1603                    $C$DW$115       .dwtag  DW_TAG_member
    1604                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$39)
    1605                            .dwattr $C$DW$115, DW_AT_name("STIR")
    1606                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("STIR")
    1607                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    1608                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1609                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1610                            .dwattr $C$DW$115, DW_AT_decl_line(0x1a2)
    1611                            .dwattr $C$DW$115, DW_AT_decl_column(0x12)
    1612                    
    1613                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1614                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x195)
    1615                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    1616                            .dwendtag $C$DW$T$45
    1617                    
    1618                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    1619                            .dwattr $C$DW$T$184, DW_AT_name("NVIC_Type")
    1620                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$45)
    1621                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    1622                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    1623                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x1a3)
    1624                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x04)
    1625                    
    1626                    
    1627                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1628                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x8c)
    1629                    $C$DW$116       .dwtag  DW_TAG_member
    1630                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$46)
    1631                            .dwattr $C$DW$116, DW_AT_name("CPUID")
    1632                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("CPUID")
    1633                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1634                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1635                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1636                            .dwattr $C$DW$116, DW_AT_decl_line(0x1b8)
    1637                            .dwattr $C$DW$116, DW_AT_decl_column(0x12)
    1638                    
    1639                    $C$DW$117       .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   31

    1640                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$39)
    1641                            .dwattr $C$DW$117, DW_AT_name("ICSR")
    1642                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("ICSR")
    1643                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1644                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1645                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1646                            .dwattr $C$DW$117, DW_AT_decl_line(0x1b9)
    1647                            .dwattr $C$DW$117, DW_AT_decl_column(0x12)
    1648                    
    1649                    $C$DW$118       .dwtag  DW_TAG_member
    1650                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$39)
    1651                            .dwattr $C$DW$118, DW_AT_name("VTOR")
    1652                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("VTOR")
    1653                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1654                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1655                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1656                            .dwattr $C$DW$118, DW_AT_decl_line(0x1ba)
    1657                            .dwattr $C$DW$118, DW_AT_decl_column(0x12)
    1658                    
    1659                    $C$DW$119       .dwtag  DW_TAG_member
    1660                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$39)
    1661                            .dwattr $C$DW$119, DW_AT_name("AIRCR")
    1662                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("AIRCR")
    1663                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1664                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1665                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1666                            .dwattr $C$DW$119, DW_AT_decl_line(0x1bb)
    1667                            .dwattr $C$DW$119, DW_AT_decl_column(0x12)
    1668                    
    1669                    $C$DW$120       .dwtag  DW_TAG_member
    1670                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$39)
    1671                            .dwattr $C$DW$120, DW_AT_name("SCR")
    1672                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("SCR")
    1673                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1674                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1675                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1676                            .dwattr $C$DW$120, DW_AT_decl_line(0x1bc)
    1677                            .dwattr $C$DW$120, DW_AT_decl_column(0x12)
    1678                    
    1679                    $C$DW$121       .dwtag  DW_TAG_member
    1680                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$39)
    1681                            .dwattr $C$DW$121, DW_AT_name("CCR")
    1682                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("CCR")
    1683                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1684                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1685                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/ccs1200/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1686                            .dwattr $C$DW$121, DW_AT_decl_line(0x1bd)
    1687                            .dwattr $C$DW$121, DW_AT_decl_column(0x12)
    1688                    
    1689                    $C$DW$122       .dwtag  DW_TAG_member
    1690                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$47)
    1691                            .dwattr $C$DW$122, DW_AT_name("SHP")
    1692                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("SHP")
    1693                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1694                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v20.2.6 Mon Oct 31 23:17:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
